


/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "MnMsgCtx.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
    协议栈打印打点方式下的.C文件宏定义
*****************************************************************************/
/*lint -e(767)*/
#define    THIS_FILE_ID        PS_FILE_ID_MN_MSG_CTX_C


/*****************************************************************************
  2 全局变量定义
*****************************************************************************/

/* MMC CTX,用于保存MMC状态机,描述表 */
MN_MSG_CONTEXT_STRU                    g_stMnMsgCtx;


/*****************************************************************************
   3 函数实现
*****************************************************************************/


MN_MSG_CONTEXT_STRU*  MN_MSG_GetMmlCtx( VOS_VOID )
{
    return &(g_stMnMsgCtx);
}


MN_MSG_CUSTOM_CFG_INFO_STRU* MN_MSG_GetCustomCfgInfo( VOS_VOID )
{
    return &(MN_MSG_GetMmlCtx()->stMsCfgInfo.stCustomCfg);
}


#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif



