/******************************************************************************

    Copyright(C)2008,Hisilicon Co. LTD.

 ******************************************************************************
  File Name       : NasEmmSecuSoftUsim.h
  Description     : NasEmmSecuSoftUsim.c header file
  History         :
     1.liuwenyu 143951       2008-12-27     Draft Enact
     2.
******************************************************************************/

#ifndef __NASEMMSECUSOFTUSIM_H__
#define __NASEMMSECUSOFTUSIM_H__



/*****************************************************************************
  1 Include Headfile
*****************************************************************************/
#include "PsCommonDef.h"

#include "NasEmmPubUGlobal.h"

/*****************************************************************************
  1.1 Cplusplus Announce
*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  #pragma pack(*)    设置字节对齐方式
*****************************************************************************/
#if (VOS_OS_VER != VOS_WIN32)
#pragma pack(4)
#else
#pragma pack(push, 4)
#endif

/*****************************************************************************
  2 macro
*****************************************************************************/
#define NAS_EMM_USIM_RAND_LEN        16
#define NAS_EMM_USIM_AUTN_LEN        16


/*****************************************************************************
  3 Massage Declare
*****************************************************************************/


/*****************************************************************************
  4 Enum
*****************************************************************************/
/* USIM AUTH RSLT */
enum    NAS_EMM_USIM_AUTH_RSLT_ENUM
{

    NAS_EMM_USIM_AUTH_MAC_FAILURE                   = 0x14,     /* USIM返回MAC不匹配错误 */
    NAS_EMM_USIM_AUTH_SYNCH_FAILURE                 = 0x15,     /* USIM返回SYNCH不匹配错误 */
    NAS_EMM_USIM_AUTH_SUCC,
    NAS_EMM_USIM_AUTH_RELT_BUTT
};
typedef VOS_UINT8 NAS_EMM_USIM_AUTH_RSLT_ENUM_UINT8;

/*****************************************************************************
  6 UNION
*****************************************************************************/


/*****************************************************************************
  7 Extern Global Variable
*****************************************************************************/

/*****************************************************************************
  8 Fuction Extern
*****************************************************************************/

extern VOS_VOID PS_GetLeastSignBitsByTrunc(const VOS_UINT8 aucSrcData[MAX_HMAC_HASH_SIZE],
                                              VOS_UINT8 aucDestData[MAX_HMAC_HASH_SIZE/2]);
/*****************************************************************************
  9 OTHERS
*****************************************************************************/










#if (VOS_OS_VER != VOS_WIN32)
#pragma pack()
#else
#pragma pack(pop)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of NasEmmSecuSoftUsim.h */
