/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : NasMainCcb.c
  版 本 号   : 初稿
  作    者   : zhoujun /40661
  生成日期   : 2011年04月01日
  最近修改   :
  功能描述   : 存放对CCB表的操作
  函数列表   :
  修改历史   :
  1.日    期   : 2011年04月01日
    作    者   : zhoujun /40661
    修改内容   : 创建文件

******************************************************************************/

/*****************************************************************************
  1 头文件包含
*****************************************************************************/


#include "PsTypeDef.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#define    THIS_FILE_ID        PS_FILE_ID_NAS_MMC_MAIN_CTX_C

/*****************************************************************************
  2 全局变量定义
*****************************************************************************/

/* MAIN CTX,用于保存MMC状态机,描述表
NAS_MMC_MAIN_CONTEXT_STRU               g_stNasMmcMainCtx;
NAS_MMC_MAIN_CONTEXT_STRU              *pg_stNasMmcMainCtx        = &g_stNasMmcMainCtx;*/


#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

