

#ifndef _NAS_GMM_INTERFACE_H_
#define _NAS_GMM_INTERFACE_H_

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "Nasrrcinterface.h"
#include "GmmRabmInterface.h"

#pragma pack(4)         /* 1字节对齐，数据结构定义保证4字节对齐 */
                        /* 放在include后，不影响其他头文件的pack参数 */
/*****************************************************************************
  2 宏定义
*****************************************************************************/
/*----------2.1 GMM当前工作模式    ------------*/
#define     GMM_NAS_STATUS_DETACHED             0       /* GMM状态为detached */
#define     GMM_NAS_STATUS_ATTACHED             1       /* GMM状态为attached */
#define     GMM_NAS_STATUS_GSM_ONLY             2       /* GMM状态为GSM方式 */
#define     GMM_NAS_STATUS_WCDMA_ONLY           3       /* GMM状态为WCDMA方式 */
#define     GMM_NAS_STATUS_GSM_TO_WCDMA         4       /* GMM从GSM到WCDMA切换中 */
#define     GMM_NAS_STATUS_WCDMA_TO_GSM         5       /* GMM从WCDMA到GSM切换中 */

/*----------2.2 工作模式原因值     ------------*/
#define     GMM_NAS_CAUSE_NORMAL                0       /* 正常情况，无原因 */
#define     GMM_NAS_CAUSE_HANDOVER_START        1       /* 网络切换开始 */
#define     GMM_NAS_CAUSE_HANDOVER_END          2       /* 网络切换结束 */
#define     GMM_NAS_CAUSE_HANDOVER_SUCCEED      3       /* 网络切换成功 */
#define     GMM_NAS_CAUSE_HANDOVER_FAILED       4       /* 网络切换失败 */

/*----------2.3 GMM错误原因        ------------*/
#define     GMM_SMS_SIGN_NO_EXIST               201
#define     GMM_SMS_SPEC_PROC_ONGOING           202


/*******************************************************************************
  3 枚举定义
*******************************************************************************/

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/

/*****************************************************************************
  5 消息头定义
*****************************************************************************/

/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/*---------------7.3 SMS和GMM的消息原语接口 --------------*/
/*=======================================================*/

/*----------7.3.1 GMMSMS_REG_STATE_IND原语 ------------*/
/* GMM用该原语通知SMS当前的PS域注册状态 */
/* V100R001版本原有接口，新增修改 */
/* 增加注册状态原因值，报告异系统切换时的原因 */

/*===== 参数宏定义 =====*/
/* 注册状态 */
#define    GMM_SMS_REG_ATTACHED             0           /* 已经注册 */
#define    GMM_SMS_REG_DETTACHED            1           /* 没有注册 */
#define    GMM_SMS_REG_GSM_ONLY             2           /* GMM状态为GSM方式 */
#define    GMM_SMS_REG_WCDMA_ONLY           3           /* GMM状态为WCDMA方式 */
#define    GMM_SMS_REG_GSM_TO_WCDMA         4           /* GMM从GSM到WCDMA切换中 */
#define    GMM_SMS_REG_WCDMA_TO_GSM         5           /* GMM从WCDMA到GSM切换中 */

/* 注册状态原因值，参见2.2 工作模式原因值 */

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/*---------------7.4 SS和GMM的消息原语接口---------------*/
/*=======================================================*/

/* V200R001版本不支持该接口 */
/*=======================================================*/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/*---------------9.1 获取GMM的当前工作网络 --------------*/
/*=======================================================*/
#define     NAS_GMM_NET_RAT_TYPE_WCDMA      (0)           /* 当前驻留为W */
#define     NAS_GMM_NET_RAT_TYPE_GSM        (1)           /* 当前驻留为G */
#define     NAS_GMM_NET_RAT_TYPE_LTE        (2)           /* 当前驻留模为L */

/* 函数返回值，表明当前GMM的工作网络 */
VOS_UINT8 GMM_GetCurNetwork (VOS_VOID);

/*=======================================================*/

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/*---------------9.2 获取GMM的当前TLLI值   --------------*/
/*=======================================================*/

/* 函数返回值，表明当前GMM可用TLLI值 */
VOS_UINT32 GMM_GetTlli (VOS_VOID);
VOS_UINT8 Gmm_GetCurrCipherInfo(VOS_VOID);
VOS_UINT8 GMM_GetRaPrioForSms (VOS_VOID);

/*=======================================================*/

#define GMM_SMS_SERVICE_AVAILABLE    0
#define GMM_SMS_SERVICE_UNAVAILABLE  1
VOS_UINT32 GMM_ServiceStatusForSms(VOS_VOID);

#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of NasGmmInterface.h*/
