/******************************************************************************

                 版权所有 (C), 2001-2015, 华为技术有限公司

 ******************************************************************************
  文 件 名   : soc_gnspwmv100_interface.h
  版 本 号   : 初稿
  作    者   : Excel2Code
  生成日期   : 2015-03-10 11:20:40
  最近修改   :
  功能描述   : 接口头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2015年3月10日
    作    者   : fWX220878
    修改内容   : 从《Hi3650V100 SOC寄存器手册_GNSPWMV100.xml》自动生成

******************************************************************************/

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#ifndef __SOC_GNSPWMV100_INTERFACE_H__
#define __SOC_GNSPWMV100_INTERFACE_H__

#ifdef __cplusplus
    #if __cplusplus
        extern "C" {
    #endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/

/****************************************************************************
                     (1/1) register_gnspwm
 ****************************************************************************/
/* 寄存器说明：GNSPMU配置寄存器
   位域定义UNION结构:  SOC_GNSPWMV100_PWM_CFG_UNION */
#define SOC_GNSPWMV100_PWM_CFG_ADDR(base)             ((base) + (0x000))

/* 寄存器说明：GNSPWM计数寄存器
   位域定义UNION结构:  SOC_GNSPWMV100_PWM_NUM_UNION */
#define SOC_GNSPWMV100_PWM_NUM_ADDR(base)             ((base) + (0x004))





/*****************************************************************************
  3 枚举定义
*****************************************************************************/



/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/



/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/



/*****************************************************************************
  7 UNION定义
*****************************************************************************/

/****************************************************************************
                     (1/1) register_gnspwm
 ****************************************************************************/
/*****************************************************************************
 结构名    : SOC_GNSPWMV100_PWM_CFG_UNION
 结构说明  : PWM_CFG 寄存器结构定义。地址偏移量:0x000，初值:0x5，宽度:32
 寄存器说明: GNSPMU配置寄存器
*****************************************************************************/
#ifndef __SOC_H_FOR_ASM__
typedef union
{
    unsigned int      value;
    struct
    {
        unsigned int  cfg_code  : 3;  /* bit[0-2] : PWM的code配置码字，只有当PWM计数值最高三位与此值匹配时且start为1，PWM才会开始工作（要先配置PWM_NUM）。 */
        unsigned int  cfg_start : 1;  /* bit[3]   : PWM的start配置码字，只有当此start位为1，且code值匹配时，PWM才会开始工作。 */
        unsigned int  reserved  : 28; /* bit[4-31]: 保留 */
    } reg;
} SOC_GNSPWMV100_PWM_CFG_UNION;
#endif
#define SOC_GNSPWMV100_PWM_CFG_cfg_code_START   (0)
#define SOC_GNSPWMV100_PWM_CFG_cfg_code_END     (2)
#define SOC_GNSPWMV100_PWM_CFG_cfg_start_START  (3)
#define SOC_GNSPWMV100_PWM_CFG_cfg_start_END    (3)


/*****************************************************************************
 结构名    : SOC_GNSPWMV100_PWM_NUM_UNION
 结构说明  : PWM_NUM 寄存器结构定义。地址偏移量:0x004，初值:0x00000000，宽度:32
 寄存器说明: GNSPWM计数寄存器
*****************************************************************************/
#ifndef __SOC_H_FOR_ASM__
typedef union
{
    unsigned int      value;
    struct
    {
        unsigned int  pwm_num : 32; /* bit[0-31]: PWM计数寄存器，最高三位需要与cfg_code符合。
                                                  计数满后输出变高。
                                                  GNSPWM工作要先配置此寄存器，再配置PWM_CFG寄存器的开始信号，GNSPWM才能工作 */
    } reg;
} SOC_GNSPWMV100_PWM_NUM_UNION;
#endif
#define SOC_GNSPWMV100_PWM_NUM_pwm_num_START  (0)
#define SOC_GNSPWMV100_PWM_NUM_pwm_num_END    (31)






/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/



/*****************************************************************************
  9 全局变量声明
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of soc_gnspwmv100_interface.h */
