

#ifndef _TAFAGENTOAMINTERFACE_H_
#define _TAFAGENTOAMINTERFACE_H_

/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include  "vos.h"

#pragma pack(4)

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  2 全局变量定义
*****************************************************************************/



/*****************************************************************************
  3 函数实现
*****************************************************************************/
/*****************************************************************************
 函 数 名  : TAF_AGENT_PidInit
 功能描述  : TAF AGENT PID的初始化函数，该PID挂在OM FID之下。
 输入参数  : enum VOS_INIT_PHASE_DEFINE enPhase
 输出参数  : 无
 返 回 值  : VOS_UINT32
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2011年12月22日
    作    者   : c00173809
    修改内容   : 新生成函数/PS融合项目
*****************************************************************************/
extern VOS_UINT32  TAF_AGENT_PidInit(enum VOS_INIT_PHASE_DEFINE enPhase);

/*****************************************************************************
 函 数 名  : TAF_AGENT_ProcMsg
 功能描述  : TAF AGENT的消息处理函数
 输入参数  : MsgBlock* pMsg
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2011年12月22日
    作    者   : C00173809
    修改内容   : 新生成函数/PS融合项目
*****************************************************************************/
extern VOS_VOID TAF_AGENT_ProcMsg(MsgBlock* pstMsg);


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

