

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/


#ifndef __DRV_TP_H__
#define __DRV_TP_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define MAX_SYS_FINGER  10

/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 消息头定义
*****************************************************************************/


/*****************************************************************************
  5 消息定义
*****************************************************************************/


/*****************************************************************************
  6 STRUCT定义
*****************************************************************************/
struct tp_priv_data
{
	int	            x_min;          /* min value of axis x */
	int         	y_min;          /* min value of axis y */
	int			    p_min;          /* min value of pressure */
	int				w_min;          /* min value of touch width */

	int	            x_max;          /* max value of axis x */
	int         	y_max;          /* max value of axis y */
	int			    p_max;          /* max value of pressure */
	int				w_max;          /* max value of touch width */

	unsigned int	fuzz_x;			/* Fuzz of x axis */
	unsigned int	fuzz_y;			/* Fuzz of y axis */
	int				fuzz_p;			/* Fuzz of pressure */
	int				fuzz_w;			/* Fuzz of touch width */
	int             points_supported;

};

struct tp_com_data
{
    int finger_num;                                 /* 点下的拇指的个数 */
    int btn_touch;                                  /* 按下或者抬起 */
};

struct tp_abs_data
{
    int abs_x;             /* 点触的x坐标值 */
    int abs_y;             /* 点触的x坐标值 */
    int abs_touch_major;    /* 点触的压力值 */
    int abs_width_major;    /* 点触的范围值 */
};

struct stru_tp_data
{
    struct tp_com_data  com_data;                   /* 固定需要的信息 */
    struct tp_abs_data  abs_data[MAX_SYS_FINGER];       /* 多触点的信息 */

};

/*****************************************************************************
  7 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/
#define COM_DATA_LEN    (sizeof(struct tp_com_data))
#define ABS_DATA_LEN    (sizeof(struct tp_abs_data))

/*****************************************************************************
  9 全局变量声明
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/












#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of drv_tp.h */
