/******************************************************************************

                  版权所有 (C), 2014, 华为技术有限公司

 ******************************************************************************
  文 件 名   : BST_LIB_List.h
  版 本 号   : 初稿
  作    者   : d00173029
  生成日期   : 2014年4月16日
  最近修改   :
  功能描述   : 链表处理
  函数列表   :

  修改历史   :
  1.日    期   : 2014年04月16日
    作    者   : d00173029
    修改内容   : 创建文件

******************************************************************************/

#ifndef __BST_LIB_LIST_H__
#define __BST_LIB_LIST_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif
#include "BST_PAL_LIST.h"
#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif


#endif
