/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : OmAppInterface.h
  版 本 号   : 初稿
  作    者   :     x51137
  生成日期   : 2010年11月2日
  最近修改   :
  功能描述   : E5 OM & APP interface
  函数列表   :
  修改历史   :
  1.日    期   : 2010年11月2日
    作    者   :
    修改内容   : 创建文件

******************************************************************************/

#ifndef __OMAPP_INTERFACE_H__
#define __OMAPP_INTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "CommAppInterface.h"

#pragma pack(4)

/*****************************************************************************
  2 数据结构定义
*****************************************************************************/

typedef enum
{
    OM_SLEEP,/* 快速休眠 */
    OM_TEST,/* 综测模式 */
    OM_OPERATE_WIFI,/* 开启/关闭wifi */
    OM_FACTORY_RESET,/* 恢复出厂设置 */
    OM_EVENT_BUTT
}OM_EVENT;

/*****************************************************************************
  3 OAM提供给APP的函数声明
*****************************************************************************/
/*****************************************************************************
 函 数 名  : Sock_Startup
 功能描述  : APP通过调用此API启动SOCKET功能
 输入参数  : void
 输出参数  : void

 返 回 值  : void
*****************************************************************************/
extern void Sock_Startup(void);


/*****************************************************************************
  4 APP提供给OAM的函数声明
*****************************************************************************/

/*****************************************************************************
 函 数 名  : ui_set_oled_light_para
 功能描述  : 老化测试需求，将OLED灯常亮
 输入参数  : void
 输出参数  : void

 返 回 值  : void
*****************************************************************************/
extern void ui_set_oled_light_para(void);
#define APP_UI_SET_OLED_LIGHT_PARA()       ui_set_oled_light_para()

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of OmAppInterface.h */
