/******************************************************************************
   版权所有 (C), 2001-2015, 华为技术有限公司

/******************************************************************************
  文件名          :
  版本号          : 1.0
  作者                : K 项目组
  生成日期     : 2015-10-26
  最近修改     :
  功能描述     : VIO LLT测试用例
  函数列表     :
  修改历史     :
  日期                : 2015-10-26
  作者                : s00163283
    修改内容      : 生成
*******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

struct LLT_TEST LLT_vio = {
	.vio_dev_ioctl = vio_dev_ioctl,
	.vio_dev_init = vio_dev_init,
	.vio_dev_exit = vio_dev_exit,
};

#ifdef __cplusplus
}
#endif
