/******************************************************************************

                  版权所有 (C), 2014, 华为技术有限公司

 ******************************************************************************
  文 件 名   : BastetWMacinterface.h
  版 本 号   : 初稿
  作    者   : z00128442
  生成日期   : 2015年5月16日
  最近修改   :
  功能描述   : WMac和Bastet模块接口头文件定义
  函数列表   :
  修改历史   :
  1.日    期   : 2015年5月16日
    作    者   : z00128442
    修改内容   : 创建文件

******************************************************************************/

#ifndef __BASTETWMACINTERFACE_H__
#define __BASTETWMACINTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
  枚举名    : WMAC_BASTET_MSG_ID_ENUM
  协议表格  :
  ASN.1描述 :
  枚举说明  : WMAC和Bastet模块发送消息定义
*****************************************************************************/
enum WMAC_BASTET_MSG_ID_ENUM
{
    ID_BASTET_WMAC_CHNL_MODE       = 0,      /* _H2ASN_MsgChoice BASTET_WMAC_CHNL_MODE_STRU */
    ID_BASTET_WMAC_ID_ENUM_BUTT
};
typedef VOS_UINT32 BASTET_WMAC_MSG_ID_ENUM_UINT32;

enum BASTET_WMAC_CHNL_MODE_ENUM
{
    BASTET_WMAC_CHNL_NORMAL      = 0,
    BASTET_WMAC_CHNL_LPM,
    BASTET_WMAC_CHNL_HPR,
    BASTET_WMAC_CHNL_BUTT
};
typedef VOS_UINT8 BASTET_WMAC_CHNL_MODE_ENUM_UINT8;

/*****************************************************************************
  4 STRUCT定义
*****************************************************************************/
/*****************************************************************************
  结构名    : BASTET_WMAC_CHNL_MODE_STRU
  协议表格  :
  ASN.1描述 :
  结构说明  : WMAC给Bastet模块发送消息定义
*****************************************************************************/
typedef struct
{
    MSG_HEADER_STRU                     stMsgHeader;          /*_H2ASN_Skip*/
    BASTET_WMAC_CHNL_MODE_ENUM_UINT8    enChnlMode;           /* 设置的CHNL模式 */
    VOS_UINT8                           ucRbId;               /* RbId字节*/
    VOS_UINT16                          usLimit;              /* 最大字节*/
} BASTET_WMAC_CHNL_MODE_STRU;

/*****************************************************************************
  5 全局变量声明
*****************************************************************************/


/*****************************************************************************
  6 消息头定义
*****************************************************************************/


/*****************************************************************************
  7 消息定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/
/*****************************************************************************
  H2ASN顶级消息结构定义
*****************************************************************************/
typedef struct
{
    BASTET_WMAC_MSG_ID_ENUM_UINT32      enMsgID;    /*_H2ASN_MsgChoice_Export BASTET_WMAC_MSG_ID_ENUM_UINT32*/

    VOS_UINT8                           aucMsgBlock[4];
    /***************************************************************************
        _H2ASN_MsgChoice_When_Comment          BASTET_WMAC_MSG_ID_ENUM_UINT32
    ****************************************************************************/
}BASTET_WMAC_MSG_DATA;
/*_H2ASN_Length UINT32*/

typedef struct
{
    VOS_MSG_HEADER
    BASTET_WMAC_MSG_DATA                stMsgData;
}BastetWMacinterface_MSG;


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of BastetWMacinterface.h */
