/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : WUeL2L3.h
  版 本 号   : 初稿
  作    者   : Jinying
  生成日期   : 2006年9月2日
  最近修改   :
  功能描述   : WUe.h 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2006年9月2日
    作    者   : Jinying
    修改内容   : 创建文件

******************************************************************************/

#ifndef __WUEL2L3_H__
#define __WUEL2L3_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define WUEL2L3_RACH_MAC_HEADER_LEN            (24)         /*单位:BIT, TCTF,2BIT; UE-Id type,2BIT; UE-Id(C-RNTI),16BIT; C/T,4BIT*/

#define WUEL2L3_CBS_RB_ID                      (33)         /*为实现需要，定义CBS对应的RB ID为33*/
/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
 枚举名    : WUEL2L3_CIPHER_ALGO_ENUM
 协议表格  : 10.3.3.4   Ciphering Algorithm
 ASN.1描述 : CipheringAlgorithm
 枚举说明  : 加密算法枚举定义
*****************************************************************************/
enum WUEL2L3_CIPHER_ALGO_ENUM
{
    WUEL2L3_CIPHER_ALGO_UEA0            = 0,
    WUEL2L3_CIPHER_ALGO_UEA1            = 1,
    WUEL2L3_CIPHER_ALGO_UEA2            = 2,

    WUEL2L3_CIPHER_ALGO_BUTT
};
typedef VOS_UINT8   WUEL2L3_CIPHER_ALGO_ENUM_UINT8;

/*****************************************************************************
   CCTRCH ID，MAC和WAS共同使用这个ID，
   WAS用来配置物理层，MAC用CCTRCH ID来匹配
   物理层上报的PHY_DATA_IND消息中的CCTRCHID，
   配置下发给物理层的PHY_DATA_REQ
*****************************************************************************/
enum WUEL2L3_CCTRCH_ENUM
{
    WUEL2L3_PCCPCH                      = 0,
    WUEL2L3_SCCPCH                      = 1,
    WUEL2L3_UL_DPCH                     = 2,
    WUEL2L3_PRACH                       = 3,
    WUEL2L3_DL_DPCH                     = 4,
    WUEL2L3_E_DCH                       = 5,
    WUEL2L3_HS_DSCH                     = 6,

    WUEL2L3_CCTRCH_BUTT
};
typedef VOS_UINT8   WUEL2L3_CCTRCH_ENUM_UINT8;

/*****************************************************************************
 结构名    : WUEL2L3_DIR_ENUM
 协议表格  :
 ASN.1描述 :
 结构说明  : 空口上下行方向
*****************************************************************************/
enum WUEL2L3_DIR_ENUM
{
    WUEL2L3_UL_DIR                       = 0,            /* uplink */
    WUEL2L3_DL_DIR                       = 1,            /* downlink */
    WUEL2L3_DIR_BUTT
};
typedef VOS_UINT8 WUEL2L3_DIR_ENUM_UINT8;

/*****************************************************************************
 结构名    : WUEL2L3_UL_MODE_ENUM
 协议表格  :
 ASN.1描述 :
 结构说明  : 上行数据传输模式
*****************************************************************************/
enum WUEL2L3_UL_MODE_ENUM
{
    WUEL2L3_UL_PCH_MODE                = 0,                /* CELL_PCH、URA_PCH */
    WUEL2L3_UL_FACH_RB0_MODE           = 1,                /* CELL_FACH用于CELL UPDATE、IDLE用于RRC CONNECTION REQUEST过程 */
    WUEL2L3_UL_NORMAL_MODE             = 2,                /* CELL_DCH、CELL_FACH非RB0 数传过程 */
    WUEL2L3_UL_MODE_BUTT
};
typedef VOS_UINT8 WUEL2L3_UL_MODE_ENUM_UINT8;

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/








#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of WUeL2L3.h */
