/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : CnasHsdFsmSysAcqTbl.h
  版 本 号   : 初稿
  作    者   : h00300778
  生成日期   : 2014年12月17日
  最近修改   :
  功能描述   : CnasHsdFsmSysAcqTbl.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年12月17日
    作    者   : h00300778
    修改内容   : 创建文件

******************************************************************************/

#ifndef __CNAS_HSD_FSM_SYS_ACQ_TBL_H__
#define __CNAS_HSD_FSM_SYS_ACQ_TBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)


/*****************************************************************************
  2 全局变量声明
*****************************************************************************/
extern NAS_STA_STRU                                         g_astCnasHsdSysAcqStaTbl[];

/*****************************************************************************
  3 宏定义
*****************************************************************************/
#define CNAS_HSD_GetSysAcqStaTbl()                          (g_astCnasHsdSysAcqStaTbl)


/*****************************************************************************
  4 枚举定义
*****************************************************************************/

/*****************************************************************************
 枚举名    : CNAS_HSD_SYS_ACQ_STA_ENUM
 枚举说明  : SYSTEM ACQUIRE状态机ID枚举定义
 1.日    期   : 2014年12月17日
   作    者   : h00300778
   修改内容   : 新建
*****************************************************************************/
enum CNAS_HSD_SYS_ACQ_STA_ENUM
{
    /* SYSTEM ACQUIRE状态机，初始状态 */
    CNAS_HSD_SYS_ACQ_STA_INIT                               = 0x00,

    /* 等待CAS回复同步确认消息 */
    CNAS_HSD_SYS_ACQ_STA_WAIT_CAS_SYNC_CNF                  = 0x01,

    /* 等待CAS上报OVERHEADER MESSAGE/REDIRECTION/SYSTEM LOST */
    CNAS_HSD_SYS_ACQ_STA_WAIT_CAS_IND                       = 0x02,

    /* 等待CAS回复停止捕获确认消息 */
    CNAS_HSD_SYS_ACQ_STA_WAIT_CAS_STOP_SYNC_CNF             = 0x03,

    /* 等待HSM上报的Session结果 */
    CNAS_HSD_SYS_ACQ_STA_WAIT_SESSION_NEG_RSLT_IND          = 0x04,

    CNAS_HSD_SYS_ACQ_STA_BUTT
};
typedef VOS_UINT32 CNAS_HSD_SYS_ACQ_STA_ENUM_UINT32;


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)
extern NAS_FSM_DESC_STRU * CNAS_HSD_GetSysAcqFsmDescAddr(VOS_VOID);
extern VOS_UINT32 CNAS_HSD_GetSysAcqStaTblSize(VOS_VOID);
#endif





#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasHsdFsmSysAcqTbl.h */
