

#ifndef __CNAS_HSD_FSM_POWER_SAVE_TBL_H__
#define __CNAS_HSD_FSM_POWER_SAVE_TBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "NasFsm.h"



#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 全局变量声明
*****************************************************************************/
extern NAS_STA_STRU                                         g_astCnasHsdPowerSaveStaTbl[];

/*****************************************************************************
  3 宏定义
*****************************************************************************/
#define CNAS_HSD_GetPowerSaveStaTbl()                        (g_astCnasHsdPowerSaveStaTbl)

/*****************************************************************************
  4 枚举定义
*****************************************************************************/

enum CNAS_HSD_POWER_SAVE_STA_ENUM
{
    /* 收到关机消息初始状态 */
    CNAS_HSD_POWER_SAVE_STA_INIT                            = 0x00,

    /* 等待CAS回复SUSPEND确认消息 */
    CNAS_HSD_POWER_SAVE_STA_WAIT_CAS_SUSPEND_CNF            = 0x01,

    /* 等待HSM回复power save确认消息 */
    CNAS_HSD_POWER_SAVE_STA_WAIT_HSM_POWERSAVE_CNF          = 0x02,

    CNAS_HSD_POWER_SAVE_STA_BUTT
};
typedef VOS_UINT32 CNAS_HSD_POWER_SAVE_STA_ENUM_UINT32;

/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

VOS_UINT32 CNAS_HSD_GetPowerSaveStaTblSize( VOS_VOID  );

NAS_FSM_DESC_STRU * CNAS_HSD_GetPowerSaveFsmDescAddr(VOS_VOID);



#endif


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasHsdFsmPowerOffTbl.h */
