

#ifndef __CNAS_HSD_FSM_INTER_SYS_TBL_H__
#define __CNAS_HSD_FSM_INTER_SYS_TBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "NasFsm.h"



#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 全局变量声明
*****************************************************************************/
extern NAS_STA_STRU g_astCnasHsdInterSysStaTbl[];

/*****************************************************************************
  3 宏定义
*****************************************************************************/
#define CNAS_HSD_GetInterSysStaTbl()                        (g_astCnasHsdInterSysStaTbl)

/*****************************************************************************
  4 枚举定义
*****************************************************************************/

enum CNAS_HSD_INTER_SYS_STA_ENUM
{
    /* 收到关机消息初始状态 */
    CNAS_HSD_INTER_SYS_STA_INIT                             = 0x00,

    /* 等待OHM确认消息 */
    CNAS_HSD_INTER_SYS_STA_WAIT_OHM_IND                     = 0x01,

    /* 等待IRAT TO LTE消息 */
    CNAS_HSD_INTER_SYS_STA_WAIT_IRAT_OR_RESUME_IND          = 0x02,

    /* 等待SUSPEND CNF消息 */
    CNAS_HSD_INTER_SYS_STA_WAIT_SUSPEND_REL_CNF             = 0x03,

    CNAS_HSD_INTER_SYS_STA_BUTT
};
typedef VOS_UINT32 CNAS_HSD_INTER_SYS_STA_ENUM_UINT32;

/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

extern VOS_UINT32 CNAS_HSD_GetInterSysStaTblSize(VOS_VOID);

extern NAS_FSM_DESC_STRU * CNAS_HSD_GetInterSysFsmDescAddr(VOS_VOID);

#endif


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasHsdFsmInterSysTbl.h */
