/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : CnasHsdMain.h
  版 本 号   : 初稿
  作    者   : h00300778
  生成日期   : 2014年12月12日
  功能描述   : CnasHsdMain.c头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年12月12日
    作    者   : h00300778
    修改内容   : 创建文件
******************************************************************************/
#ifndef _CNAS_HSD_MAIN_H_
#define _CNAS_HSD_MAIN_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "PsCommonDef.h"
#include "PsTypeDef.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif /* __cpluscplus */
#endif /* __cpluscplus */

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

VOS_UINT32 CNAS_HSD_FsmProcessEvent(
    VOS_UINT32                          ulCurState,
    VOS_UINT32                          ulEventType,
    VOS_VOID                           *pRcvMsg
);

VOS_UINT32 CNAS_HSD_InitPid(
    enum VOS_INIT_PHASE_DEFINE         enInitPhase
);

VOS_UINT32  CNAS_HSD_InitTask(VOS_VOID);

VOS_VOID CNAS_HSD_MsgProc (struct MsgCB* pstMsg);

VOS_UINT32 CNAS_HSD_PreProcessMsg(
    VOS_UINT32                          ulEventType,
    struct MsgCB                       *pstMsg
);

VOS_VOID CNAS_HSD_ProcessHsdIntMsg(VOS_VOID);

VOS_VOID CNAS_HSD_ProcessBufferMsg(VOS_VOID);

VOS_UINT32 CNAS_HSD_ProcessMsgInFsm(
    VOS_UINT32                          ulEventType,
    struct MsgCB                       *pstMsg
);

VOS_VOID  CNAS_HSD_RegFsm(VOS_VOID);

VOS_UINT32 CNAS_HSD_RegL2Fsm(VOS_VOID);

VOS_UINT32 CNAS_HSD_RegMainL1Fsm(VOS_VOID);

VOS_UINT32 CNAS_HSD_RegPreFsm(VOS_VOID);

#endif

#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
#if __cplusplus
}
#endif /* __cpluscplus */
#endif /* __cpluscplus */

#endif
