/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : CnasHsdFsmPowerOffTbl.h
  版 本 号   : 初稿
  作    者   : h00300778
  生成日期   : 2014年12月9日
  最近修改   :
  功能描述   : CnasHsdFsmPowerOffTbl.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年12月9日
    作    者   : h00300778
    修改内容   : 创建文件

******************************************************************************/

#ifndef __CNAS_HSD_FSM_POWER_OFF_TBL_H__
#define __CNAS_HSD_FSM_POWER_OFF_TBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "NasFsm.h"



#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 全局变量声明
*****************************************************************************/
extern NAS_STA_STRU                                         g_astCnasHsdPowerOffStaTbl[];

/*****************************************************************************
  3 宏定义
*****************************************************************************/
#define CNAS_HSD_GetPowerOffStaTbl()                        (g_astCnasHsdPowerOffStaTbl)

/*****************************************************************************
  4 枚举定义
*****************************************************************************/
/*****************************************************************************
 枚举名    : CNAS_HSD_POWER_OFF_STA_ENUM
 枚举说明  : 状态机ID枚举定义
 1.日    期   : 2014年12月9日
   作    者   : h00300778
   修改内容   : 新建
*****************************************************************************/
enum CNAS_HSD_POWER_OFF_STA_ENUM
{
    /* 收到关机消息初始状态 */
    CNAS_HSD_POWER_OFF_STA_INIT                             = 0x00,

    /* 等待HSM关机回复确认消息 */
    CNAS_HSD_POWER_OFF_STA_WAIT_HSM_POWEROFF_CNF            = 0x01,

    /* 等待HSM关机回复确认消息 */
    CNAS_HSD_POWER_OFF_STA_WAIT_EHSM_POWEROFF_CNF           = 0x02,

    /* 等待HLU关机回复确认消息 */
    CNAS_HSD_POWER_OFF_STA_WAIT_HLU_POWEROFF_CNF            = 0x03,

    /* 等待CAS关机回复确认消息 */
    CNAS_HSD_POWER_OFF_STA_WAIT_CAS_POWEROFF_CNF            = 0x04,


    CNAS_HSD_POWER_OFF_STA_BUTT
};
typedef VOS_UINT32 CNAS_HSD_POWER_OFF_STA_ENUM_UINT32;

/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

VOS_UINT32 CNAS_HSD_GetPowerOffStaTblSize( VOS_VOID  );

NAS_FSM_DESC_STRU * CNAS_HSD_GetPowerOffFsmDescAddr(VOS_VOID);



#endif


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasHsdFsmPowerOffTbl.h */
