/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : hids_elf_drvccore.c
  版 本 号   : 初稿
  作    者   : c00326366
  生成日期   : 2015年12月24日
  最近修改   :
  功能描述   : 编译ELF文件给HIDS工具解析
  函数列表   :
  修改历史   :
  1.日    期   : 2015年12月24日
    作    者   : c00326366
    修改内容   : 创建文件

******************************************************************************/


void drvccore_main(void)
{
// 消息结构声明开始
    // TODO
// 消息结构声明结束
}

