/******************************************************************************

                  版权所有 (C), 2014, 华为技术有限公司

 ******************************************************************************
  文 件 名   : BastetGasInterface.h
  版 本 号   : 初稿
  作    者   : l00220658
  生成日期   : 2015年06月04日
  最近修改   :
  功能描述   : Gas和Bastet模块接口头文件定义
  函数列表   :
  修改历史   :
  1.日    期   : 2015年06月04日
    作    者   : l00220658
    修改内容   : 创建文件

******************************************************************************/

#ifndef __BASTETGASINTERFACE_H__
#define __BASTETGASINTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
typedef VOS_UINT32 ( *BST_GAS_RECV_NET_QUAL_FUNC)(
    const VOS_UINT32        ulModemId,
    const VOS_UINT32        ulRatMode,
    const VOS_UINT32        ulCellId,
    const VOS_INT16         sRscp,
    const VOS_INT16         sEcio );

/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
  枚举名    : GAS_BASTET_MSG_ID_ENUM
  协议表格  :
  ASN.1描述 :
  枚举说明  : bastet给Gas模块发送消息定义
*****************************************************************************/
enum GAS_BASTET_MSG_ID_ENUM
{
    /* bastet发给Gas的消息原语 */                           /*备注*/
    ID_GAS_BASTET_NET_QUAL_CB      = 0x1,                   /* _H2ASN_MsgChoice GAS_BASTET_MSG_ID_ENUM_UINT16 */ 
    ID_GAS_BASTET_ID_ENUM_BUTT
};
typedef VOS_UINT16 GAS_BASTET_MSG_ID_ENUM_UINT16;

/*****************************************************************************
  4 STRUCT定义
*****************************************************************************/

/*****************************************************************************
 结构名    : BST_GAS_REG_NET_CB_STRU
 结构说明  : BASTET与GAS交互原语
 1.日    期   : 2015年06月04日
   作    者   : l00220658
   修改内容   : 新增结构

*****************************************************************************/
typedef struct
{
    MSG_HEADER_STRU                     stMsgHeader;          /*_H2ASN_Skip*/
    VOS_UINT32                          ulModemId;
    VOS_UINT32                          ulRatMode;
    BST_GAS_RECV_NET_QUAL_FUNC          pfRcvCb;
} BST_GAS_REG_NET_CB_STRU;


/*****************************************************************************
 结构名    : BST_GAS_NET_QUAL_STRU
 结构说明  : GAS模块接收回调结构体
 1.日    期   : 2015年06月04日
   作    者   : l00220658
   修改内容   : 新增结构

*****************************************************************************/
typedef struct
{
    VOS_UINT32                         ulModemId;
    VOS_UINT32                         ulRatMode;
    BST_GAS_RECV_NET_QUAL_FUNC         pfFunCB;
}BST_GAS_NET_QUAL_STRU;

/*****************************************************************************
  5 全局变量声明
*****************************************************************************/


/*****************************************************************************
  6 消息头定义
*****************************************************************************/


/*****************************************************************************
  7 消息定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/
/*****************************************************************************
  H2ASN顶级消息结构定义
*****************************************************************************/
typedef struct
{
    GAS_BASTET_MSG_ID_ENUM_UINT16       enMsgID;    /*_H2ASN_MsgChoice_Export GAS_BASTET_MSG_ID_ENUM_UINT16*/

    VOS_UINT8                           aucMsgBlock[4];
    /***************************************************************************
        _H2ASN_MsgChoice_When_Comment          GAS_BASTET_MSG_ID_ENUM_UINT16
    ****************************************************************************/
}BASTET_Gas_MSG_DATA;
/*_H2ASN_Length UINT32*/

typedef struct
{
    VOS_MSG_HEADER
    BASTET_Gas_MSG_DATA                 stMsgData;
}BastetGasInterface_MSG;


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of BastetGasinterface.h */
