/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : OmBastetInterface.h
  版 本 号   : 初稿
  作    者   : s00211350
  生成日期   : 2014年7月5日
  最近修改   :
  功能描述   : Bastet Maintain功能头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年7月5日
    作    者   : s00211350
    修改内容   : 创建文件

******************************************************************************/

#ifndef __OMBASTETINTERFACE_H__
#define __OMBASTETINTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#if (VOS_OS_VER != VOS_WIN32)
#pragma pack(4)
#else
#pragma pack(push, 4)
#endif


/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define OM_BST_IP_ADDR_LEN              (4)
#define OM_BST_MNTN_APP_NUM             (32)
/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
 枚举名    : 定义上报Mntn消息标识，Bastet仅有一个上限报告标识
 协议表格  :
 ASN.1描述 :
 枚举说明  : ID_BST_OM_AGENT_INFO_IND, 上报Maintain消息
*****************************************************************************/
enum OM_BST_MSG_TYPE_ENUM
{
    ID_BST_OM_AGENT_INFO_IND    = 0xB06F,
    ID_BST_OM_MSG_TYPE_BUTT     = 0xFFFF,
};
typedef VOS_UINT16                      OM_BST_MSG_TYPE_ENUM_UINT16;

/*****************************************************************************
 枚举名    : 定义Bstet代理任务类型
 协议表格  :
 ASN.1描述 :
 枚举说明  :
    ID_BST_OM_TASK_TYPE_MAIN,       主任务
    ID_BST_OM_TASK_TYPE_EMAIL,      Email代理邮件查询任务
    ID_BST_OM_TASK_TYPE_HEARTBEAT,  心跳代理业务
*****************************************************************************/
enum OM_BST_TASK_TYPE_ENUM
{
    ID_BST_OM_TASK_TYPE_MIN             = 0,
    ID_BST_OM_TASK_TYPE_MAIN,
    ID_BST_OM_TASK_TYPE_EMAIL,
    ID_BST_OM_TASK_TYPE_HEARTBEAT,
    ID_BST_OM_TASK_TYPE_BUTT
};
typedef VOS_UINT16                      OM_BST_APP_TYPE_ENUM_UINT16;

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/
/*****************************************************************************
 结构名    :OM_BST_HEADER_STRU
 结构说明  :
*****************************************************************************/
typedef struct
{
    VOS_UINT8                           ucFuncType;
    VOS_UINT8                           ucReserved;
    VOS_UINT16                          usLength;
    VOS_UINT32                          ulSn;
    VOS_UINT32                          ulTimeStamp;
}OM_BST_HEADER_STRU;

/*****************************************************************************
 结构名    :OM_BST_MSG_STRU
 结构说明  : 
*****************************************************************************/
typedef struct
{
    OM_BST_HEADER_STRU                  stBstOmHead;
    VOS_UINT16                          usPrimId;
    VOS_UINT16                          usToolId;
    VOS_UINT8                           aucData[4];
}OM_BST_MSG_STRU;

/*****************************************************************************
 结构名    :OM_BST_APP_INFO_STRU
 结构说明  : 
*****************************************************************************/
typedef struct
{
    OM_BST_APP_TYPE_ENUM_UINT16         usAppType;      /*代理应用类型*/
    VOS_UINT16                          usTaskId;       /*任务ID*/
    VOS_UINT16                          usTaskState;    /*任务运行状态*/
    VOS_UINT16                          usCycleLen;     /*循环长度*/
    VOS_UINT16                          usSuccNum;      /*成功次数*/
    VOS_UINT16                          usErrorNum;     /*失败次数*/
    VOS_UINT16                          usRemotePort;   /*远程IP端口号*/
    VOS_UINT16                          usLocalPort;    /*本地IP端口号*/
    VOS_UINT8                           aucRemoteIp[OM_BST_IP_ADDR_LEN];/*远程IP地址*/
    VOS_UINT8                           aucLocalIp[OM_BST_IP_ADDR_LEN]; /*本地IP地址*/
    VOS_UINT32                          ulTxFlow;       /*发送流量统计*/
    VOS_UINT32                          ulRxFlow;       /*接收流量统计*/
}OM_BST_APP_INFO_STRU;


/*****************************************************************************
 结构名    :OM_BST_AGENT_APP_NUM_STRU
 结构说明  : 
*****************************************************************************/
typedef struct
{
    VOS_UINT16                          usReserved;
    VOS_UINT16                          usAgentAppNum;
    OM_BST_APP_INFO_STRU                stBstAppList[OM_BST_MNTN_APP_NUM];
}OM_BST_AGENT_APP_NUM_STRU;

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of OmBastetInterface.h */

