/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : CnasXregSndCas.h
  版 本 号   : 初稿
  作    者   : l60609
  生成日期   : 2014年7月3日
  最近修改   :
  功能描述   : CnasXregSndCas.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年7月3日
    作    者   : l60609
    修改内容   : 创建文件

******************************************************************************/

#ifndef __CNAS_XREG_SND_CAS_H__
#define __CNAS_XREG_SND_CAS_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "PsCommonDef.h"
#include  "cas_1x_access_ctrl_proc_nas_pif.h"
#include  "PsRrmInterface.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)


/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

extern VOS_VOID CNAS_XREG_SndCASEstReq(CAS_CNAS_1X_REGISTRATION_TYPE_ENUM_UINT8 enRegType);

extern VOS_VOID CNAS_XREG_SndCASAbortReq(VOS_VOID);

extern VOS_VOID CNAS_XREG_SndCASSciReq(VOS_UINT8 ucSicValue);

extern VOS_VOID CNAS_XREG_SndRrmRegisterInd(
    RRM_PS_TASK_TYPE_ENUM_UINT16        enTaskType
);

extern VOS_VOID CNAS_XREG_SndRrmDeRegisterInd(
    RRM_PS_TASK_TYPE_ENUM_UINT16        enTaskType
);

extern VOS_VOID CNAS_XREG_SndCasBeginSessionNtf(VOS_VOID);

extern VOS_VOID CNAS_XREG_SndCasEndSessionNtf(VOS_VOID);

#endif


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasXregSndCas.h */
