/*************************************************************************
*   版权所有(C) 2010-2015, 深圳华为技术有限公司.
*
*   文 件 名 :  
*
*   作    者 :  xujingcui x00221564
*
*   描    述 :  内部头文件
*
*   修改记录 :
*
*************************************************************************/
#ifndef __WAKELOCK_H__
#define __WAKELOCK_H__

#include <bsp_wakelock.h>
/************************************************************************
*时钟模块调试接口
************************************************************************/
void debug_wake_lock(PWC_CLIENT_ID_E id);
void debug_wake_unlock(PWC_CLIENT_ID_E id);
#endif
