/************************************************************************
  Copyright   : 2005-2007, Huawei Tech. Co., Ltd.
  File name   : MmAuth.h
  Author      : sxbo
  Version     : V200R001
  Date        : 2005-08-16
  Description : 该头文件定义了MM模块AuthProc子模块函数
  History     :
  1. Date:2005-04-19
     Author: ---
     Modification:Create
  2.日    期   : 2006年08月09日
    作    者   : 蒋丽萍j60010247
    修改内容   : 问题单A32D03479，在PC机上实现时将#pragma pack(0)和#pragma pack()加编译开关
************************************************************************/

#ifndef _MM_AUTH_H_
#define _MM_AUTH_H_

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "NasUsimmApi.h"


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*******************************************************************************
  3 枚举定义
*******************************************************************************/

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/

/*****************************************************************************
  5 消息头定义
*****************************************************************************/
/* 模块名＋意义＋HEADER */


/*****************************************************************************
  6 消息定义
*****************************************************************************/

/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  8 OTHERS定义
*****************************************************************************/
VOS_VOID MM_GsmAuthProc(VOS_VOID);

VOS_VOID MM_UsimGsmAuth(VOS_VOID);

VOS_VOID MM_SimAuth(VOS_VOID);

VOS_VOID MM_SndGsmAuthenReq(VOS_VOID);

VOS_VOID MM_RcvSimAuthCnf(VOS_VOID* Msg);

VOS_UINT8 MM_RcvGsmAuthenticationCnf(VOS_VOID* pMsg);

VOS_VOID MM_HandleGsmAuthenFail(VOS_VOID);

VOS_VOID NAS_MML_SecContext2GTO3G(VOS_UINT8 *pucIk, VOS_UINT8 *pucCk, VOS_UINT8 *pucKc);

extern VOS_UINT8 Mm_ComRandJudge(VOS_VOID);

extern VOS_VOID Mm_ComAuthenRcvUsimCnfSuccess(VOS_VOID);

#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of MmAuth.h*/
