/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : NasMmcFsmInterSysOosTbl.h
  版 本 号   : 初稿
  作    者   : W00176964
  生成日期   : 2011年07月04日
  最近修改   :
  功能描述   : NasMmcFsmInterSysOosTbl.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年07月27日
    作    者   : w00176964
    修改内容   : 创建文件

******************************************************************************/
#ifndef _NAS_MMC_FSM_INTER_SYS_OOS_TBL_H_
#define _NAS_MMC_FSM_INTER_SYS_OOS_TBL_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include  "vos.h"
#include  "PsTypeDef.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  1 全局变量定义
*****************************************************************************/
extern NAS_STA_STRU                                             g_astNasMmcInterSysOosStaTbl[];



/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define NAS_MMC_GetInterSysOosStaTbl()                      (g_astNasMmcInterSysOosStaTbl)



/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
 枚举名    : NAS_MMC_INTER_SYS_OOS_STA_ENUM
 协议表格  :
 ASN.1描述 :
 枚举说明  : 状态机InterSysOos的状态枚举定义
*****************************************************************************/
enum NAS_MMC_INTER_SYS_OOS_STA_ENUM
{
    /* 出服务区搜网过程中的初始化状态*/
    NAS_MMC_INTER_SYS_OOS_STA_INIT                                     =0,

    /* 出服务区搜网过程中等待MM的挂起 */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_MM_SUSPEND_RSP                      =1,

    /* 出服务区搜网过程中等待接入层的恢复 */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_AS_RESUME_IND                       =2,

    /* 出服务区搜网过程中等待WAS的SUSPPEND_REL_CNF */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_WAS_SUSPEND_REL_CNF                 =3,

    /* 出服务区搜网过程中等待MM的恢复 */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_MM_RESUME_RSP                       =4,

    /* 出服务区搜网过程中等待WAS系统消息 */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_WAS_SYSINFO_IND                     =5,

    /* 出服务区搜网过程中等待GAS系统消息 */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_GAS_SYSINFO_IND                     =6,

    /* 出服务区搜网过程中等待L系统消息 */
    NAS_MMC_INTER_SYS_OOS_STA_WAIT_LMM_SYSINFO_IND                     =7,

    NAS_MMC_INTER_SYS_OOS_BUTT
};

typedef VOS_UINT32  NAS_MMC_INTER_SYS_OOS_STA_ENUM_UINT32;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/



/*****************************************************************************
  10 函数声明
*****************************************************************************/
VOS_UINT32 NAS_MMC_GetInterSysOosStaTblSize( VOS_VOID  );

NAS_FSM_DESC_STRU * NAS_MMC_GetInterSysOosFsmDescAddr(VOS_VOID);



#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of NasMmcFsmInterSysOosTbl.h */

