/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : NasMmcFsmPoweroffTlb.h
  版 本 号   : 初稿
  作    者   : w00176964
  生成日期   : 2011年07月18日
  最近修改   :
  功能描述   : NasMmcFsmPoweroffTlb.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年07月18日
    作    者   : w00176964
    修改内容   : 创建文件

******************************************************************************/
#ifndef _NAS_MMC_FSM_POWER_OFF_TBL_H_
#define _NAS_MMC_FSM_POWER_OFF_TBL_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include  "vos.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  1 全局变量定义
*****************************************************************************/
extern NAS_STA_STRU                            g_astNasMmcPowerOffStaTbl[];



/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define NAS_MMC_GetPowerOffStaTbl()                     (g_astNasMmcPowerOffStaTbl)



/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
 枚举名    : NAS_MMC_POWER_OFF_STA_ENUM
 枚举说明  : power off状态机状态枚举定义
 1.日    期   : 2011年7月18日
   作    者   : w00176964
   修改内容   : 新生成函数
*****************************************************************************/
enum NAS_MMC_POWER_OFF_STA_ENUM
{
    /* 关机过程,等待关机消息 */
    NAS_MMC_POWER_OFF_STA_POWEROFF_INIT,

    /* 关机过程,等待MM和GMM的回复 */
    NAS_MMC_POWER_OFF_STA_WAIT_MM_POWEROFF_CNF,

    /* 关机过程,等待主模的关机回复 */
    NAS_MMC_POWER_OFF_STA_WAIT_MASTER_MODE_POWEROFF_CNF,

    /* 关机过程,等待从模的关机回复 */
    NAS_MMC_POWER_OFF_STA_WAIT_SLAVE_MODE_POWEROFF_CNF,

#if (FEATURE_ON == FEATURE_LTE)
    /* 关机过程,等待LMM的回复 */
    NAS_MMC_POWER_OFF_STA_WAIT_LMM_USIM_STATUS_CNF,

    /* Added by s00246516 for L-C互操作项目, 2014-01-28, Begin */
    /* Power Save过程,等待LMM的挂起回复 */
    NAS_MMC_POWER_OFF_STA_WAIT_LMM_SUSPEND_CNF,
    /* Added by s00246516 for L-C互操作项目, 2014-01-28, End */
#endif
    NAS_MMC_POWER_OFF_STA_WAIT_WAS_SUSPEND_CNF,

    NAS_MMC_POWER_OFF_STA_WAIT_GAS_SUSPEND_CNF,

    NAS_MMC_POWER_OFF_STA_WAIT_EPS_CONN_REL_IND,

    NAS_MMC_POWER_OFF_STA_WAIT_RRC_CONN_REL_IND,

    NAS_MMC_POWER_OFF_BUTT
};

typedef VOS_UINT32  NAS_MMC_POWER_OFF_STA_ENUM_UINT32;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/



/*****************************************************************************
  10 函数声明
*****************************************************************************/
VOS_UINT32 NAS_MMC_GetPowerOffStaTblSize( VOS_VOID  );

NAS_FSM_DESC_STRU * NAS_MMC_GetPowerOffFsmDescAddr(VOS_VOID);

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

