
#ifndef _NAS_MMC_FSM_SWITCH_ON_TBL_H_
#define _NAS_MMC_FSM_SWITCH_ON_TBL_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include  "vos.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  1 全局变量定义
*****************************************************************************/
extern NAS_STA_STRU                            g_astNasMmcSwitchOnStaTbl[];


/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define NAS_MMC_GetSwitchOnStaTbl()                     (g_astNasMmcSwitchOnStaTbl)


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


enum NAS_MMC_SWITCH_ON_STA_ENUM
{
    /* 开机状态机，初始状态 */
    NAS_MMC_SWITCH_ON_STA_SWITCH_ON_INIT,

    /* 开机初始化过程,等待sim卡文件的回复 */
    NAS_MMC_SWITCH_ON_STA_WAIT_SIM_FILES_CNF,

    /* 开机初始化过程,等待MM和GMM的回复 */
    NAS_MMC_SWITCH_ON_STA_WAIT_MM_START_CNF,

    
    /* 开机初始化过程,等待GAS的回复 */
    NAS_MMC_SWITCH_ON_STA_WAIT_GAS_START_CNF,

    /* 开机初始化过程,等待WAS的回复 */
    NAS_MMC_SWITCH_ON_STA_WAIT_WAS_START_CNF,
    
#if (FEATURE_ON == FEATURE_LTE)
    /* 开机初始化过程,等待LMM的回复 */
    NAS_MMC_SWITCH_ON_STA_WAIT_L_START_CNF,
#endif
    NAS_MMC_SWITCH_ON_BUTT
};

typedef VOS_UINT32  NAS_MMC_SWITCH_ON_STA_ENUM_UINT32;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/



/*****************************************************************************
  10 函数声明
*****************************************************************************/
VOS_UINT32 NAS_MMC_GetSwitchOnStaTblSize( VOS_VOID  );

NAS_FSM_DESC_STRU * NAS_MMC_GetSwitchOnFsmDescAddr(VOS_VOID);

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif


