/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : CnasXsdFsmSwitchOnTbl.h
  版 本 号   : 初稿
  作    者   : y00245242
  生成日期   : 2014年7月3日
  最近修改   :
  功能描述   : CnasXsdFsmSwitchOnTbl.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年7月3日
    作    者   : y00245242
    修改内容   : 创建文件

******************************************************************************/

#ifndef __CNAS_XSD_FSM_SWITCH_ON_TBL_H__
#define __CNAS_XSD_FSM_SWITCH_ON_TBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 全局变量声明
*****************************************************************************/
extern NAS_STA_STRU                                         g_astCnasXsdSwitchOnStaTbl[];

/*****************************************************************************
  3 宏定义
*****************************************************************************/
#define CNAS_XSD_GetSwitchOnStaTbl()                        (g_astCnasXsdSwitchOnStaTbl)

/*****************************************************************************
  4 枚举定义
*****************************************************************************/
/*****************************************************************************
 枚举名    : CNAS_XSD_SWITCH_ON_STA_ENUM
 枚举说明  : 开机状态机ID枚举定义
 1.日    期   : 2014年07月03日
   作    者   : h00246512
   修改内容   : 新建
*****************************************************************************/
enum CNAS_XSD_SWITCH_ON_STA_ENUM
{
    /* 开机状态机，初始状态 */
    CNAS_XSD_SWITCH_ON_STA_INIT                             = 0x00,

    /* 开机初始化过程,等待获取卡文件的回复消息 */
    CNAS_XSD_SWITCH_ON_STA_WAIT_CARD_FILE_CNF               = 0x01,

    /* 开机初始化过程,等待XCC开机回复确认消息 */
    CNAS_XSD_SWITCH_ON_STA_WAIT_XCC_START_CNF               = 0x02,

    /* 开机初始化过程,等待XREG开机回复确认消息 */
    CNAS_XSD_SWITCH_ON_STA_WAIT_XREG_START_CNF              = 0x03,

    /* 开机初始化过程,等待CAS开机回复确认消息 */
    CNAS_XSD_SWITCH_ON_STA_WAIT_CAS_START_CNF               = 0x04,

    CNAS_XSD_SWITCH_ON_STA_BUTT
};
typedef VOS_UINT32 CNAS_XSD_SWITCH_ON_STA_ENUM_UINT32;

/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)
VOS_UINT32 CNAS_XSD_GetSwitchOnStaTblSize(VOS_VOID);

NAS_FSM_DESC_STRU * CNAS_XSD_GetSwitchOnFsmDescAddr(VOS_VOID);

#endif



#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasXsdFsmSwitchOnTbl.h */
