/******************************************************************************

                  版权所有 (C), 2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : QosFcChannelFlowCtrl.h
  版 本 号   : 初稿
  作    者   : w00145177
  生成日期   : 2011年12月23日
  最近修改   :
  功能描述   : QoS流控通道流控管理头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年12月23日
    作    者   : w00145177
    修改内容   : 创建文件

******************************************************************************/

#ifndef __QOS_FC_CHANNEL_FLOWCTRL_H__
#define __QOS_FC_CHANNEL_FLOWCTRL_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#if (VOS_OS_VER != VOS_WIN32)
#pragma pack(4)
#else
#pragma pack(push, 4)
#endif

/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*****************************************************************************
  3 Massage Declare
*****************************************************************************/

/*****************************************************************************
  4 枚举定义
*****************************************************************************/
/*****************************************************************************
 结构名    : QOS_FC_CHANNEL_STATE_ENUM
 协议表格  :
 ASN.1描述 :
 结构说明  : 定义通道流控状态
*****************************************************************************/
typedef enum QOS_FC_CHANNEL_STATE
{
    QOS_FC_CHANNEL_STATE_NORMAL,        /* 通道正常数传状态 */
    QOS_FC_CHANNEL_STATE_FLOWCTRL,      /* 通道流控状态 */
    QOS_FC_CHANNEL_STATE_BUTT
} QOS_FC_CHANNEL_STATE_ENUM;

typedef VOS_UINT32 QOS_FC_CHANNEL_STATE_ENUM_UINT32;


/*****************************************************************************
   5 STRUCT定义
*****************************************************************************/
/*****************************************************************************
 结构名    : QOS_FC_CHANNEL_ENTITY_STRU
 协议表格  :
 ASN.1描述 :
 结构说明  : 定义QoS流控通道实体结构
*****************************************************************************/
typedef struct QOS_FC_CHANNEL_ENTITY
{
    VOS_UINT8                        ucRabId;            /* 承载标识  */
    QCI_TYPE_ENUM_UINT8              enQci;
    VOS_UINT8                        ucReserve[2];
    QOS_FC_CHANNEL_STATE_ENUM_UINT32 enChannelState;
} QOS_FC_CHANNEL_ENTITY_STRU;



/*****************************************************************************
  6 UNION定义
*****************************************************************************/


/*****************************************************************************
  7 全局变量声明
*****************************************************************************/


/*****************************************************************************
  8 函数声明
*****************************************************************************/
extern VOS_VOID QosFcChannelInit(VOS_VOID);
extern VOS_VOID QosFc_ChannelRestore(VOS_UINT8 ucRabId);
extern VOS_VOID QosFc_ChannelControl(VOS_UINT8 ucRabId);
extern VOS_VOID QosFc_UpdateChannelQos(VOS_UINT8 ucRabId, QCI_TYPE_ENUM_UINT8 enQci);

/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


#if (VOS_OS_VER != VOS_WIN32)
#pragma pack()
#else
#pragma pack(pop)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

