/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : CnasXccFsmMainTbl.h
  版 本 号   : 初稿
  作    者   : y00213812
  生成日期   : 2014年7月3日
  最近修改   :
  功能描述   : CnasXccFsmMainTbl.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年7月3日
    作    者   : y00213812
    修改内容   : 创建文件

******************************************************************************/

#ifndef __CNAS_XCC_FSM_MAIN_TBL_H__
#define __CNAS_XCC_FSM_MAIN_TBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define CNAS_XCC_GetL1MainStaTbl()                          (g_astCnasXccL1MainStaTbl)


/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
 枚举名    : CNAS_XCC_L1_STA_ENUM
 枚举说明  : L1状态机ID枚举定义
 1.日    期   : 2014年09月03日
   作    者   : w00242748
   修改内容   : 新建
*****************************************************************************/
enum CNAS_XCC_L1_STA_ENUM
{
    CNAS_XCC_L1_STA_IDLE                        ,     /* 无业务状态 */

    CNAS_XCC_L1_STA_MT_CALLING                  ,     /* 被叫状态 */

    CNAS_XCC_L1_STA_MO_CALLING                  ,     /* 主叫状态 */

    CNAS_XCC_L1_STA_ENDING                      ,     /* 业务结束状态 */

    CNAS_XCC_L1_STA_CONVERSATION                ,     /* 会话状态 */

    CNAS_XCC_L1_STA_POWER_OFF                   ,     /* 关机状态 */

    CNAS_XCC_L1_STA_BUTT
};

typedef VOS_UINT32  CNAS_XCC_L1_STA_ENUM_UINT32;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/
extern NAS_FSM_DESC_STRU                    g_stCnasXccMainFsmDesc;
extern NAS_STA_STRU                         g_astCnasXccL1MainStaTbl[];


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

VOS_UINT32 CNAS_XCC_GetPreProcessStaTblSize(VOS_VOID);

NAS_FSM_DESC_STRU* CNAS_XCC_GetPreFsmDescAddr(VOS_VOID);


VOS_UINT32 CNAS_XCC_GetL1MainStaTblSize(VOS_VOID);

NAS_FSM_DESC_STRU * CNAS_XCC_GetMainFsmDescAddr(VOS_VOID);







#endif


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasXccFsmPreProcTbl.h */


