/******************************************************************************

                  版权所有 (C), 2014, 华为技术有限公司
*******************************************************************************
  文 件 名   : BST_APP_LongRRC.h
  版 本 号   : 初稿
  作    者   : w00346326
  生成日期   : 2015年10月23日
  最近修改   :
  功能描述   : 终端保持RRC连接状态方案 的头文件
  函数列表   :

  修改历史   :
  1.日    期   : 2015年05月21日
    作    者   : w00346326
    修改内容   : 创建文件

******************************************************************************/
#ifndef __BST_APP_LONGRRC_H__
#define __BST_APP_LONGRRC_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "BST_Platform.h"
#include "BST_DRV_Net.h"
#include "BST_OS_Timer.h"
#include "BST_IP_Define.h"
#include "BST_OS_Memory.h"

#if (BST_OS_VER == BST_HISI_VOS)
#pragma pack(4)
#elif(BST_OS_VER == BST_WIN32)
#pragma pack(push, 4)
#endif

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define BST_APP_LONGRRC_INTERVAL_S        2                 /* 发包间隔，单位:s */
#define BST_APP_LONGRRC_INVALID_SUSTAIN_S 0                 /* 无效的发包持续时长，单位:s */
#define BST_APP_LONGRRC_SUSTAIN_MAX_S     300               /* 最长发包持续时长，单位:s */
#define BST_APP_LONGRRC_PKT_SRC_OFFSET    12                /* IP包中源地址相对于包首地址的偏移量，单位:字节 */

/*****************************************************************************
  3 Massage Declare
*****************************************************************************/

/*****************************************************************************
  4 枚举定义
*****************************************************************************/

/*****************************************************************************
  5 类/结构定义
*****************************************************************************/
typedef struct
{
    BST_OS_TIMERID_T                      ulIntervalId;     /* 定时发包定时器ID */
    BST_UINT32                            ulPktsLeft;       /* 剩余发包次数 */
}BST_APP_LONGRRC_INFO_STRU;
/*****************************************************************************
  6 UNION定义
*****************************************************************************/

/*****************************************************************************
  7 全局变量声明
*****************************************************************************/

/*****************************************************************************
  8 函数声明
*****************************************************************************/
BST_VOID           BST_APP_LongRRCInit( BST_VOID );
BST_VOID           BST_APP_LongRRCSetNetParm( BST_UINT32 ulIPv4,  BST_BOOL bNetStateUp );
BST_ERR_ENUM_UINT8 BST_APP_LongRRCConfig( BST_UINT32 ulSustainS );

/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/

#if (BST_OS_VER == BST_HISI_VOS)
#pragma pack()
#elif(BST_OS_VER == BST_WIN32)
#pragma pack(pop)
#endif

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif

