

#ifndef __CNAS_PRL_MEM_H__
#define __CNAS_PRL_MEM_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "PsCommonDef.h"
#include "PsLogdef.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define CNAS_PRL_BUFF_SIZE                                  (32768)
#define CNAS_PRL_BLOCK_MAX_NUM                              (2)

#define CNAS_PRL_GetMemBuffInedx()                          (g_stCnasPrlBuff.ulIndex)
#define CNAS_PRL_GetMemBlock(index)                         (&g_stCnasPrlBuff.astBlock[index])

/*****************************************************************************
  3 枚举定义
*****************************************************************************/



/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


typedef struct
{
    VOS_UINT8                          *pucHead;                                /* 内存区首地址    */
    VOS_UINT8                          *pucCur;                                 /* 内存区当前分配地址        */
    VOS_UINT32                          ulRemainSize;                           /* 内存块剩余大小                */
}CNAS_PRL_BUFF_STRU;


typedef struct
{
    VOS_UINT32                          ulIndex;                                /* 已申请内存块个数 */
    CNAS_PRL_BUFF_STRU                  astBlock[CNAS_PRL_BLOCK_MAX_NUM];       /* 内存块数组       */
}CNAS_PRL_MEM_BUFF_STRU;

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

VOS_VOID CNAS_PRL_InitMemBuff(VOS_VOID);

VOS_UINT32 CNAS_PRL_MallocMemBuff(VOS_VOID);

VOS_VOID CNAS_PRL_MemFreeBuff(VOS_VOID);

VOS_VOID *CNAS_PRL_Malloc(
    VOS_UINT32                          ulSize
);

VOS_VOID CNAS_PRL_Free(
    VOS_VOID                          **pFree,
    VOS_UINT32                          ulSize
);

#endif

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of CnasXsdFsmSysAcqTbl.h */

