
#ifndef _NAS_UTRANCTRL_FSM_MODE_CHANGE_TBL_H_
#define _NAS_UTRANCTRL_FSM_MODE_CHANGE_TBL_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include  "vos.h"
#include  "PsTypeDef.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  1 全局变量定义
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_TDS)

extern NAS_STA_STRU                            g_astNasUtranCtrlModeChangeStaTbl[];


/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define NAS_UTRANCTRL_GetModeChangeStaTbl()    (g_astNasUtranCtrlModeChangeStaTbl)


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


enum NAS_UTRANCTRL_MODE_CHANGE_STA_ENUM
{
    NAS_UTRANCTRL_MODE_CHANGE_STA_INIT,                                         /* 模式变更状态机初始化状态 */

    NAS_UTRANCTRL_MODE_CHANGE_STA_WAIT_SLAVEMODE_CNF,                           /* 模式变更状态机等待从模回复状态 */

    NAS_UTRANCTRL_MODE_CHANGE_STA_WAIT_MASTERMODE_CNF,                          /* 模式变更状态机等待主模回复状态 */

    NAS_UTRANCTRL_MODE_CHANGE_STA_WAIT_MASTERMODE_REL_CNF,                          /* 模式变更状态机等待主模回复状态 */

    NAS_UTRANCTRL_MODE_CHANGE_STA_BUTT
};
typedef VOS_UINT32  NAS_UTRANCTRL_MODE_CHANGE_STA_ENUM_UINT32;

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/



/*****************************************************************************
  10 函数声明
*****************************************************************************/

VOS_UINT32 NAS_UTRANCTRL_GetModeChangeStaTblSize(VOS_VOID);

NAS_FSM_DESC_STRU * NAS_UTRANCTRL_GetModeChangeFsmDescAddr(VOS_VOID);
#endif

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of NasUtranCtrlFsmModeChangeTbl.h */

