
#ifndef _NAS_UTRANCTRL_FSM_SYSCFG_TBL_H_
#define _NAS_UTRANCTRL_FSM_SYSCFG_TBL_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include  "vos.h"
#include  "NasFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

#if (FEATURE_ON == FEATURE_UE_MODE_TDS)
/*****************************************************************************
  1 全局变量定义
*****************************************************************************/
extern NAS_STA_STRU                               g_astNasUtranCtrlSyscfgStaTbl[];

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define NAS_UTRANCTRL_GetSysCfgStaTbl()           (g_astNasUtranCtrlSyscfgStaTbl)

/*****************************************************************************
  3 枚举定义
*****************************************************************************/


enum NAS_UTRANCTRL_SYSCFG_STA_ENUM
{
    /* SYSCFG状态机初始化状态 */
    NAS_UTRANCTRL_SYSCFG_STA_INIT,

    /*SYSCFG过程，等待WAS的RRMM_SYS_CFG_CNF设置回复消息 */
    NAS_UTRANCTRL_SYSCFG_STA_WAIT_WAS_SYSCFG_CNF,

    /*SYSCFG过程，等待TD的RRMM_SYS_CFG_CNF设置回复消息 */
    NAS_UTRANCTRL_SYSCFG_STA_WAIT_TD_SYSCFG_CNF,

    NAS_UTRANCTRL_SYSCFG_STA_BUTT
};

typedef VOS_UINT32  NAS_UTRANCTRL_SYSCFG_STA_ENUM_UINT32;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/



/*****************************************************************************
  10 函数声明
*****************************************************************************/
VOS_UINT32 NAS_UTRANCTRL_GetSysCfgStaTblSize( VOS_VOID  );
NAS_FSM_DESC_STRU* NAS_UTRANCTRL_GetSysCfgFsmDescAddr(VOS_VOID);


#endif  /* end of #if (FEATURE_ON == FEATURE_UE_MODE_TDS) */


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

