/******************************************************************************

                  版权所有 (C), 2001-2012, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TafMtaUnSolicitedReport.h
  版 本 号   : 初稿
  作    者   : 赵学理
  生成日期   : 2013年4月11日
  最近修改   :
  功能描述   : MTA模块与at模块交互主动上报相关命令的处理函数
  函数列表   :
  修改历史   :
  1.日    期   : 2013年4月11日
    作    者   : z00161729
    修改内容   : 主动上报AT命令控制下移至C核

******************************************************************************/

#ifndef __TAFMTAUNSOLICITEDREPORT_H__
#define __TAFMTAUNSOLICITEDREPORT_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "TafMtaComm.h"
#include "TafMtaMain.h"
#include "AtMtaInterface.h"
#include "TafMtaTimerMgmt.h"
#include "TafAgentInterface.h"
#include "TafSdcCtx.h"
#include "TafSdcLib.h"

/* Modified by z00161729 for V9R1 STK升级, 2013-7-24, begin */
#include "NasStkInterface.h"
/* Modified by z00161729 for V9R1 STK升级, 2013-7-24, end */
#include "NasUtranCtrlInterface.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
  4 全局变量声明
*****************************************************************************/
/*****************************************************************************
  5 消息头定义
*****************************************************************************/
/*****************************************************************************
  6 消息定义
*****************************************************************************/
/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/
/*****************************************************************************
  8 UNION定义
*****************************************************************************/
/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/
/*****************************************************************************
  10 函数声明
*****************************************************************************/
/* Added by s00217060 for 主动上报AT命令控制下移至C核, 2013-4-1, begin */
VOS_VOID TAF_MTA_RcvAtSetCurcNotify(VOS_VOID *pMsg);
VOS_VOID TAF_MTA_RcvAtQryCurcReq(VOS_VOID *pMsg);
VOS_VOID TAF_MTA_RcvAtSetUnsolicitedRptReq(VOS_VOID *pMsg);
VOS_VOID TAF_MTA_RcvAtQryUnsolicitedRptReq(VOS_VOID *pMsg);
VOS_VOID TAF_MTA_RcvTafAgentGetSysModeReq(VOS_VOID *pMsg);
VOS_VOID TAF_MTA_SndStkCurcRptCfgInfoInd(AT_MTA_CURC_SET_NOTIFY_STRU *pMsg);

/* Added by s00217060 for 主动上报AT命令控制下移至C核, 2013-4-1, end */


#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif


