/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TafSpmFsmMain.h
  版 本 号   : 初稿
  作    者   : w00176964
  生成日期   : 2013年5月8日
  最近修改   :
  功能描述   : TafSpmFsmMain.C 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2013年5月8日
    作    者   : w00176964
    修改内容   : 创建文件

******************************************************************************/

#ifndef _TAF_SPM_FSM_MAIN_H
#define _TAF_SPM_FSM_MAIN_H

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
/* Added by s00217060 for VoLTE_PhaseII  项目, 2013-09-18, begin */
#if (FEATURE_IMS == FEATURE_ON)
#include "SpmImsaInterface.h"
#endif
/* Added by s00217060 for VoLTE_PhaseII  项目, 2013-09-18, end */

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
/* Modified by y00245242 for VoLTE_PhaseI  项目, 2013-7-30, begin */
VOS_UINT32 TAF_SPM_RcvAppReqMsg_Main(
    VOS_UINT32                          ulEventType,
    struct MsgCB                       *pstMsg
);
/* Modified by y00245242 for VoLTE_PhaseI  项目, 2013-7-30, end */

VOS_UINT32 TAF_SPM_RcvSpmServiceCtrlResultInd_Main(
    VOS_UINT32                          ulEventType,
    struct MsgCB                       *pstMsg
);
/* Added by s00217060 for VoLTE_PhaseII  项目, 2013-09-24, end */

VOS_UINT32 TAF_SPM_RcvPbFdnInd_Main(
    VOS_UINT32                          ulEventType,
    struct MsgCB                       *pstMsg
);

/* Deleted by s00217060 for VoLTE_PhaseIII  项目, 2013-12-14, begin */
/* Deleted by s00217060 for VoLTE_PhaseIII  项目, 2013-12-14, end */

/* Added by s00217060 for VoLTE_PhaseIII  项目, 2013-12-30, begin */
VOS_VOID TAF_SPM_SendServiceRequetFail_Main(
    VOS_UINT32                          ulEventType,
    struct MsgCB                       *pstMsg,
    VOS_UINT32                          ulCause
);
/* Added by s00217060 for VoLTE_PhaseIII  项目, 2013-12-30, end */




#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of TAF_SPM_FSM_MAIN.h */


