/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TafXCallProcCttf.h
  版 本 号   : 初稿
  作    者   : c00177591
  生成日期   : 2015年10月23日
  最近修改   :
  功能描述   : TafXCallProcCttf.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2015年10月23日
    作    者   : c00177591
    修改内容   : 创建文件

******************************************************************************/

#ifndef __TAF_X_CALL_PROC_CTTF_H__
#define __TAF_X_CALL_PROC_CTTF_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "cttf_1x_mac_voice_decrypt_statistics_pif.h"
#include "cttf_1x_mac_voice_encrypt_statistics_pif.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)
#if (FEATURE_ON == FEATURE_CHINA_TELECOM_VOICE_ENCRYPT)
#if (FEATURE_ON == FEATURE_CHINA_TELECOM_VOICE_ENCRYPT_TEST_MODE)
VOS_VOID TAF_XCALL_RcvCttfDecryptVoiceDataReportInd(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvCttfDecryptVoiceStatReportInd(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvCttfEncryptVoiceDataReportInd(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvCttfEncryptVoiceStatReportInd(VOS_VOID *pMsg);

#endif /*FEATURE_CHINA_TELECOM_VOICE_ENCRYPT_TEST_MODE*/
#endif /*FEATURE_CHINA_TELECOM_VOICE_ENCRYPT*/
#endif /*FEATURE_UE_MODE_CDMA*/

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of __TAF_X_CALL_PROC_CTTF_H__ */
