/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TafXCallProcTimer.h
  版 本 号   : 初稿
  作    者   : w00176964
  生成日期   : 2014年11月17日
  最近修改   :
  功能描述   : TafXCallProcTimer.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2014年11月17日
    作    者   : w00176964
    修改内容   : 创建文件

******************************************************************************/

#ifndef __TAF_X_CALL_PROC_TIMER_H__
#define __TAF_X_CALL_PROC_TIMER_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include "vos.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  1 全局变量定义
*****************************************************************************/

/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)
VOS_VOID TAF_XCALL_RcvTiWaitCallRedialPeriodExpired(VOS_VOID *pMsg);
VOS_VOID TAF_XCALL_RcvTiWaitCallRedialIntervalExpired(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvTiStartAndStopContDtmfIntervalExpired(VOS_VOID *pMsg);

#if (FEATURE_ON == FEATURE_CHINA_TELECOM_VOICE_ENCRYPT)
VOS_VOID TAF_XCALL_RcvTiVoiceEncryptWaitOrigReqExpired(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvTiDelayEncryptReqExpired(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvTiTx01Expired(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvTiTx02Expired(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvTiRemoteCtrlWaitApAnswerExpired(VOS_VOID *pMsg);

VOS_VOID TAF_XCALL_RcvTiPubKeyUpdateWaitAckExpired(VOS_VOID *pMsg);
#endif

#endif

#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of TafXCallProcTimer.h */



