

#ifndef __TAFAPSFSMCDATAHANDOFFTBL_H__
#define __TAFAPSFSMCDATAHANDOFFTBL_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "TafFsm.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/

#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)
extern TAF_STA_STRU                             g_astTafApsCdataHandOffStaTbl[];
#define TAF_APS_GetCdataHandOffStaTbl()        (g_astTafApsCdataHandOffStaTbl)

#endif


/*****************************************************************************
  3 枚举定义
*****************************************************************************/

enum TAF_APS_CDATA_HANDOFF_SUBSTA_ENUM
{
    TAF_APS_CDATA_HANDOFF_SUBSTA_INIT                  = 0x00,   /* CDATA HANDOFF状态机的初始状态 */
    TAF_APS_CDATA_HANDOFF_SUBSTA_WAIT_HSM_HANDOFF_CNF  = 0x01,   /* CDMA模式下数据服务模式切换——等待HSM回复数据切换子状态 */
    TAF_APS_CDATA_HANDOFF_SUBSTA_BUTT
} ;
typedef VOS_UINT32 TAF_APS_CDATA_HANDOFF_SUBSTA_ENUM_UINT32;

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)

VOS_UINT32 TAF_APS_GetCdataHandOffStaTblSize( VOS_VOID );
TAF_FSM_DESC_STRU * TAF_APS_GetCdataHandOffFsmDescAddr( VOS_VOID );

#endif







#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of TafApsFsmCdataHandOffTbl.h */
