/*******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : hids_elf_taf.h
  版 本 号   : 初稿
  作    者   : h00360002
  生成日期   : 2015年12月03日
  功能描述   : TAF的elf文件
  函数列表   :
  修改历史   :
  1.日    期   : 2015年12月03日
    作    者   : h00360002
    修改内容   : 创建文件
******************************************************************************/

/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "MnCallApi.h"
#include "MnMsgApi.h"
#include "TafAppSsa.h"
#include "TafAppMma.h"
#include "TafApsApi.h"
#include "PsTypeDef.h"
#include "AtInternalMsg.h"
#include "AtCmdMsgProc.h"
#include "AtTimer.h"
#include "TafDrvAgent.h"
#include "AtRabmInterface.h"
#include "PppInterface.h"
#include "AtDipcInterface.h"
#include "AtMtaInterface.h"
#include "TafMtaAgps.h"
#include "AtImsaInterface.h"
#include "TafAppXsmsInterface.h"
#include "AtNdisInterface.h"
#include "MtaRrcInterface.h"
#include "MtaPhyInterface.h"
#include "omerrorlog.h"
#include "TafMtaTimerMgmt.h"
#include "MtcMmaInterface.h"
#include "MtcRrcInterface.h"
#include "MtaMtcInterface.h"
#include "MtcGmmInterface.h"
#include "MtcDebug.h"
#include "MtcRcmInterface.h"
#include "PsRrmInterface.h"
#ifdef __cplusplus
#if __cplusplus
extern "C" {

   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
enum TAF_ELF_PH_ICC_TYPE
{
    ELF_TAF_PH_ICC_UNKNOW       = 0,
    ELF_TAF_PH_ICC_SIM          = 1,
    ELF_TAF_PH_ICC_USIM         = 2,
};
typedef VOS_UINT8   TAF_ELF_PH_ICC_TYPE_UINT8;

/*****************************************************************************
 枚举名    : OM_ELF_MTA_MSG_TYPE_ENUM
 枚举说明  : OM和MTA间的消息类型枚举
 1.日    期   : 2015年12月16日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
enum OM_ELF_MTA_MSG_TYPE_ENUM
{
    ELF_ID_OM_ERR_LOG_CTRL_IND      = 0x9001,
    ELF_ID_OM_ERR_LOG_REPORT_REQ    = 0x9002,
    ELF_ID_OM_ERR_LOG_REPORT_CNF    = 0x9003,
    ELF_ID_OM_FTM_CTRL_IND          = 0x9004,
    ELF_ID_OM_FTM_REPROT_IND        = 0x9005,
    ELF_ID_OM_INFO_CLT_REPORT_REQ   = 0x9010,
    ELF_ID_OM_INFO_CLT_REPORT_CNF   = 0x9011,
};
typedef VOS_UINT32   OM_ELF_MTA_MSG_TYPE_ENUM_UINT32;

/*****************************************************************************
 枚举名    : OM_ELF_ERR_LOG_ALM_STATUS_ENUM
 枚举说明  : OM ERROR LOG上报控制开关枚举
 1.日    期   : 2015年12月16日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
enum OM_ELF_ERR_LOG_ALM_STATUS_ENUM
{
    ELF_OM_ERR_LOG_ALM_OFF,
    ELF_OM_ERR_LOG_ALM_ON,
    ELF_OM_ERR_LOG_ALM_BUTT
};
typedef VOS_UINT8   OM_ELF_ERR_LOG_ALM_STATUS_ENUM_UINT8;

/*****************************************************************************
 枚举名    : OM_ELF_ERR_LOG_ALM_STATUS_ENUM
 枚举说明  : OM ERROR LOG上报级别枚举
 1.日    期   : 2015年12月16日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
enum OM_ELF_ERR_LOG_CTRL_LEVEL_ENUM
{
    ELF_OM_ERR_LOG_CTRL_LEVEL_NULL,
    ELF_OM_ERR_LOG_CTRL_LEVEL_CRITICAL,
    ELF_OM_ERR_LOG_CTRL_LEVEL_MAJOR,
    ELF_OM_ERR_LOG_CTRL_LEVEL_MINOR,
    ELF_OM_ERR_LOG_CTRL_LEVEL_WARNING
};
typedef VOS_UINT8   OM_ELF_ERR_LOG_CTRL_LEVEL_ENUM_UINT8;
typedef VOS_UINT16   OM_ELF_ERR_LOG_CTRL_LEVEL_ENUM_UINT16;

/*****************************************************************************
 枚举名    : OM_ELF_FTM_CTRL_STATUS_ENUM
 枚举说明  : 工程模式主动上报控制开关枚举
 1.日    期   : 2015年12月16日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
enum OM_ELF_FTM_CTRL_STATUS_ENUM
{
    ELF_OM_FTM_CTRL_OFF,
    ELF_OM_FTM_CTRL_ON,
    ELF_OM_FTM_CTRL_BUTT
};
typedef VOS_UINT8   OM_ELF_FTM_CTRL_STATUS_ENUM_UINT8;

/*****************************************************************************
  4 结构体定义
*****************************************************************************/

/*****************************************************************************
 结构名    : TAF_ELF_NULL_STRU
 结构说明  : 填充结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_UINT8                                       aucReserve[4];
}TAF_ELF_NULL_STRU;



/*****************************************************************************
 结构名    :  MN_CALL_ELF_INFO_QRY_CNF_STRU
 结构说明  :  AT与MN Call模块间获取Call信息的消息结构的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      clientId;                               /* 用户ID */
    VOS_UINT8                           ucNumOfCalls;                           /* 所有正在通话的个数 */
    VOS_CHAR                            ucReserved;                             /* 保留字段 */
    MN_CALL_INFO_PARAM_STRU             astCallInfos[MN_CALL_MAX_NUM];           /* 所用正在通话的信息 */
} MN_CALL_ELF_INFO_QRY_CNF_STRU;

/*****************************************************************************
 结构名    :  TAF_PH_ELF_SET_UUS1_INFO_CNF_STRU
 结构说明  :  设置UUS1 INFO回复消息的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T          ClientId;   /*端口号*/
    MN_OPERATION_ID_T       OpId;       /*操作ID*/
    VOS_UINT8               ucReserved; /* 保留字段 */
    VOS_UINT32              ulRet;      /*回复结果*/
}TAF_PH_ELF_SET_UUS1_INFO_CNF_STRU;

/*****************************************************************************
 结构名    :  TAF_PH_ELF_QRY_UUS1_INFO_CNF_STRU
 结构说明  :  查询UUS1 INFO回复消息的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T          ClientId;                               /*端口号*/
    MN_OPERATION_ID_T       OpId;                                   /*操作ID*/
    VOS_UINT8               ucReserved;                             /* 保留字段 */
    VOS_UINT32              ulRet;                                  /*回复结果*/
    VOS_UINT32              ulActNum;                               /*用户服务信令1的个数*/
    MN_CALL_UUS1_INFO_STRU  stUus1Info[MN_CALL_MAX_UUS1_MSG_NUM];   /*用户服务信令1的信息*/
    MN_CALL_SET_UUS1_TYPE_ENUM_U32      aenSetType[MN_CALL_MAX_UUS1_MSG_NUM];  /*要设置的用户服务信令1类型 */
}TAF_PH_ELF_QRY_UUS1_INFO_CNF_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_SET_ALS_CNF_STRU
 结构说明  :  设置ALS回复消息的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T          ClientId;   /*端口号*/
    MN_OPERATION_ID_T       OpId;       /*操作ID*/
    VOS_UINT8               ucReserved; /* 保留字段 */
    VOS_UINT32              ulRet;      /*回复结果*/
}MN_CALL_ELF_SET_ALS_CNF_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_QRY_ALS_CNF_STRU
 结构说明  :  AT与CS AT^ALS命令查询结构的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                  ClientId;                                   /*端口号*/
    MN_OPERATION_ID_T               OpId;                                       /*操作ID*/
    VOS_UINT8                       ucReserved1;                                /* 保留字段 */
    VOS_UINT32                      ulRet;                                      /*回复结果*/
    MN_CALL_ALS_LINE_NO_ENUM_U8     enAlsLine;                                  /*当前使用的线路号*/
    VOS_UINT8                       aucReserved2[3];                            /* 保留字段 */
}MN_CALL_ELF_QRY_ALS_CNF_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_ECC_NUM_INFO_STRU
 结构说明  :  CALL向AT上报当前所有的紧急呼号码列表的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      usClientId;
    VOS_UINT8                           aucReserve[2];
    VOS_UINT32                          ulEccNumCount;
    MN_CALL_CUSTOM_ECC_NUM_STRU         astCustomEccNumList[MN_CALL_MAX_EMC_NUM];
} MN_CALL_ELF_ECC_NUM_INFO_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_EVT_HOLD_STRU
 结构说明  :  呼叫保持事件上报结构体的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      usClientId;
    TAF_CALL_VOICE_DOMAIN_ENUM_UINT8    enVoiceDomain;                          /* VOICE DOMAIN */
    VOS_UINT8                           aucReserve[1];
    VOS_UINT8                           ucCallNum;
    VOS_UINT8                           aucCallId[MN_CALL_MAX_NUM];
    VOS_UINT8                           aucCurcRptCfg[MN_CALL_RPT_CFG_MAX_SIZE];        /* CURC设置的主动上报标识 */
    VOS_UINT8                           aucUnsolicitedRptCfg[MN_CALL_RPT_CFG_MAX_SIZE]; /* 单个命令设置的主动上报标识 */
} MN_CALL_ELF_EVT_HOLD_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_EVT_RETRIEVE_STRU
 结构说明  :  呼叫保持事件上报结构体的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      usClientId;
    TAF_CALL_VOICE_DOMAIN_ENUM_UINT8    enVoiceDomain;                          /* VOICE DOMAIN */
    VOS_UINT8                           aucReserve[1];
    VOS_UINT8                           ucCallNum;
    VOS_UINT8                           aucCallId[MN_CALL_MAX_NUM];
    VOS_UINT8                           aucCurcRptCfg[MN_CALL_RPT_CFG_MAX_SIZE];        /* CURC设置的主动上报标识 */
    VOS_UINT8                           aucUnsolicitedRptCfg[MN_CALL_RPT_CFG_MAX_SIZE]; /* 单个命令设置的主动上报标识 */
} MN_CALL_ELF_EVT_RETRIEVE_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_CLPR_GET_CNF_STRU
 结构说明  :  查询呼叫源号码回复结果的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_UINT32                          ulRet;
    AT_APPCTRL_STRU                     stAppCtrl;
    MN_CALL_REDIRECT_INFO               stRedirectInfo;
}MN_CALL_ELF_CLPR_GET_CNF_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_EVT_CHANNEL_INFO_STRU
 结构说明  :  MN_CALL_EVT_CHANNEL_INFO_IND事件的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      usClientId;

    VOS_UINT8                           ucIsLocalAlertingFlag;                  /* 是否为本地播放回铃音标识1:本地播放回铃音；0:网络放音*/
    MN_CALL_CODEC_TYPE_ENUM_U8          enCodecType;                            /* codec type */

    TAF_CALL_VOICE_DOMAIN_ENUM_UINT8    enVoiceDomain;                          /* VOICE DOMAIN */
    VOS_UINT8                           aucRsv[3];
} MN_CALL_ELF_EVT_CHANNEL_INFO_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_SET_CSSN_CNF_STRU
 结构说明  :  MN_CALL_EVT_SET_CSSN_CNF事件结构的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    TAF_ERROR_CODE_ENUM_UINT32          ulRet;          /*回复结果*/
    MN_CLIENT_ID_T                      ClientId;       /*端口号*/
    MN_OPERATION_ID_T                   OpId;           /*操作ID*/
    VOS_UINT8                           ucReserved;     /* 保留字段 */
} MN_CALL_ELF_SET_CSSN_CNF_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_MODIFY_CNF_STRU
 结构说明  :  Modify回复消息的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      usClientId;                             /* 端口号 */
    MN_OPERATION_ID_T                   ucOpId;                                 /* 操作ID */
    MN_CALL_ID_T                        ucCallId;                               /* Call ID */
    TAF_CS_CAUSE_ENUM_UINT32            enCause;                                /* 错误码 */
}MN_CALL_ELF_MODIFY_CNF_STRU;

/*****************************************************************************
 结构名    :  MN_CALL_ELF_EVT_MODIFY_STATUS_IND_STRU
 结构说明  :  Modify状态指示的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                                  usClientId;
    MN_OPERATION_ID_T                               ucOpId;                     /* 操作ID */
    MN_CALL_ID_T                                    ucCallId;                   /* Call ID */
    MN_CALL_MODIFY_STATUS_ENUM_UINT8                enModifyStatus;             /* 当前的MODIFY的过程状态 */
    TAF_CALL_VOICE_DOMAIN_ENUM_UINT8                enVoiceDomain;              /* VOICE DOMAIN，这里始终是IMS域 */
    MN_CALL_TYPE_ENUM_U8                            enCurrCallType;             /* 当前呼叫类型 */
    MN_CALL_TYPE_ENUM_U8                            enExpectCallType;           /* 期望呼叫类型 */
    TAF_CS_CAUSE_ENUM_UINT32                        enCause;                    /* 错误码，仅在MODIFY_PROC_END有异常时才使用 */
} MN_CALL_ELF_EVT_MODIFY_STATUS_IND_STRU;

/*****************************************************************************
 结构名    :  TAF_CALL_ELF_ECONF_DIAL_CNF_STRU
 结构说明  :  Modify回复消息的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                      usClientId;                             /* 端口号 */
    MN_OPERATION_ID_T                   ucOpId;                                 /* 操作ID */
    MN_CALL_ID_T                        ucCallId;                               /* Call ID */
    TAF_CS_CAUSE_ENUM_UINT32            enCause;                                /* 错误码 */
}TAF_CALL_ELF_ECONF_DIAL_CNF_STRU;

/*****************************************************************************
 结构名    :  TAF_CALL_ELF_EVT_ECONF_NOTIFY_IND_STRU
 结构说明  :  增强型会议的状态指示的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                                  usClientId;
    MN_OPERATION_ID_T                               ucOpId;                     /* 操作ID */
    VOS_UINT8                                       ucNumOfCalls;               /* 所有正在通话的个数 */
    TAF_CALL_ECONF_INFO_PARAM_STRU                  astCallInfo[TAF_CALL_MAX_ECONF_CALLED_NUM];     /* 所用正在通话的信息 */
} TAF_CALL_ELF_EVT_ECONF_NOTIFY_IND_STRU;

/*****************************************************************************
 结构名    :  TAF_CALL_ELF_ECONF_INFO_QRY_CNF_STRU
 结构说明  :  AT与MN Call模块间获取增强型多方通话信息的消息结构的去事件类型后的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_CLIENT_ID_T                                          usClientId;         /* 用户ID */
    VOS_UINT8                                               ucNumOfMaxCalls;
    VOS_UINT8                                               ucNumOfCalls;       /* 多方通话与会者个数 */
    TAF_CALL_ECONF_INFO_PARAM_STRU                          astCallInfo[TAF_CALL_MAX_ECONF_CALLED_NUM];     /* 所用正在通话的信息 */
}TAF_CALL_ELF_ECONF_INFO_QRY_CNF_STRU;

/*****************************************************************************
 结构名    :  TAF_AT_ELF_MN_CALLBACK_CS_CALL_STRU
 结构说明  :  从TAF发往AT的MN_CALLBACK_CS_CALL消息对应的结构体
 1.日    期   : 2015年12月03日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    VOS_UINT16                                      usMsgName;                              /* 消息名 */
    VOS_UINT8                                       aucReserved1[2];
    MN_CLIENT_ID_T                                  clientId;
    VOS_UINT16                                      usLen;
    MN_CALL_EVENT_ENUM_U32                          enUnionStructSelChoice;
    union
    {
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_ORIG;                 /* 0x00 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_CALL_PROC;            /* 0x01 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_ALERTING;             /* 0x02 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_CONNECT;              /* 0x03 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_RELEASED;             /* 0x04 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_INCOMING;             /* 0x05 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_SS_CMD_PROGRESS;      /* 0x06 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_SS_CMD_RSLT;          /* 0x07 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_SS_NOTIFY;            /* 0x08 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_START_DTMF_CNF;       /* 0x09 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_NULL1;                /* 无此消息,占位 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_STOP_DTMF_CNF;        /* 0x0b */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_NULL2;                /* 无此消息,占位 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_CCBS_POSSIBLE;        /* 0x0d */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_TIME_EXPIRED;         /* 0x0e */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_UUS1_INFO;            /* 0x0f */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_GET_CDUR_CNF;         /* 0x10 */
        MN_CALL_ELF_INFO_QRY_CNF_STRU               stMN_CALL_EVT_CLCC_INFO;            /* 0x11 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_ALL_RELEASED;         /* 0x12 */
        TAF_PH_ELF_SET_UUS1_INFO_CNF_STRU           stMN_CALL_EVT_SET_UUS1_INFO_CNF;    /* 0x13 */
        TAF_PH_ELF_QRY_UUS1_INFO_CNF_STRU           stMN_CALL_EVT_QRY_UUS1_INFO_CNF;    /* 0x14 */
        MN_CALL_ELF_SET_ALS_CNF_STRU                stMN_CALL_EVT_SET_ALS_CNF;          /* 0x15 */
        MN_CALL_ELF_QRY_ALS_CNF_STRU                stMN_CALL_EVT_QRY_ALS_CNF;          /* 0x16 */
        MN_CALL_ELF_ECC_NUM_INFO_STRU               stMN_CALL_EVT_ECC_NUM_IND;          /* 0x17 */
        MN_CALL_ELF_EVT_HOLD_STRU                   stMN_CALL_EVT_HOLD;                 /* 0x18 */
        MN_CALL_ELF_EVT_RETRIEVE_STRU               stMN_CALL_EVT_RETRIEVE;             /* 0x19 */
        MN_CALL_ELF_CLPR_GET_CNF_STRU               stMN_CALL_EVT_CLPR_SET_CNF;         /* 0x1a */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_NULL3;                /* 无此消息,占位 */
        MN_CALL_ELF_EVT_CHANNEL_INFO_STRU           stMN_CALL_EVT_CHANNEL_INFO_IND;     /* 0x1c */
        MN_CALL_ELF_ECC_NUM_INFO_STRU               stMN_CALL_EVT_XLEMA_CNF;            /* 0x1d */
        MN_CALL_ELF_SET_CSSN_CNF_STRU               stMN_CALL_EVT_SET_CSSN_CNF;         /* 0x1e */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_CALL_ORIG_CNF;        /* 0x1f */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_SUPS_CMD_CNF;         /* 0x20 */
        MN_CALL_INFO_STRU                           stMN_CALL_EVT_NULL4;                /* 无此消息,占位 */
        TAF_CALL_EVT_DTMF_CNF_STRU                  stMN_CALL_EVT_START_DTMF_RSLT;      /* 0x22 */
        TAF_CALL_EVT_DTMF_CNF_STRU                  stMN_CALL_EVT_STOP_DTMF_RSLT;       /* 0x23 */
        MN_CALL_EVT_QRY_ECALL_INFO_CNF_STRU         stMN_CALL_EVT_QRY_ECALL_INFO_CNF;   /* 0x24 */
        MN_CALL_ELF_MODIFY_CNF_STRU                 stMN_CALL_EVT_CALL_MODIFY_CNF;      /* 0x25 */
        MN_CALL_ELF_MODIFY_CNF_STRU                 stMN_CALL_EVT_CALL_ANSWER_REMOTE_MODIFY_CNF;    /* 0x26 */
        MN_CALL_ELF_EVT_MODIFY_STATUS_IND_STRU      stMN_CALL_EVT_CALL_MODIFY_STATUS_IND;           /* 0x27 */
        TAF_CALL_EVT_SEND_FLASH_RSLT_STRU           stTAF_CALL_EVT_SEND_FLASH_RSLT;     /* 0x28 */
        TAF_CALL_EVT_CALLED_NUM_INFO_IND_STRU       stTAF_CALL_EVT_CALLED_NUM_INFO_IND; /* 0x29 */
        TAF_CALL_EVT_CALLING_NUM_INFO_IND_STRU      stTAF_CALL_EVT_CALLING_NUM_INFO_IND;/* 0x2a */
        TAF_CALL_EVT_DISPLAY_INFO_IND_STRU          stTAF_CALL_EVT_DISPLAY_INFO_IND;    /* 0x2b */
        TAF_CALL_EVT_EXT_DISPLAY_INFO_IND_STRU      stTAF_CALL_EVT_EXT_DISPLAY_INFO_IND;/* 0x2c */
        TAF_CALL_EVT_CONN_NUM_INFO_IND_STRU         stTAF_CALL_EVT_CONN_NUM_INFO_IND;   /* 0x2d */
        TAF_CALL_EVT_REDIR_NUM_INFO_IND_STRU        stTAF_CALL_EVT_REDIR_NUM_INFO_IND;  /* 0x2e */
        TAF_CALL_EVT_SIGNAL_INFO_IND_STRU           stTAF_CALL_EVT_SIGNAL_INFO_IND;     /* 0x2f */
        TAF_CALL_EVT_LINE_CTRL_INFO_IND_STRU        stTAF_CALL_EVT_LINE_CTRL_INFO_IND;  /* 0x30 */
        TAF_CALL_EVT_CALL_WAITING_IND_STRU          stTAF_CALL_EVT_CALL_WAITING_IND;    /* 0x31 */
        TAF_CALL_ELF_ECONF_DIAL_CNF_STRU            stTAF_CALL_ECONF_DIAL_CNF;          /* 0x32 */
        TAF_CALL_ELF_EVT_ECONF_NOTIFY_IND_STRU      stTAF_CALL_EVT_ECONF_NOTIFY_IND;    /* 0x33 */
        TAF_CALL_ELF_ECONF_INFO_QRY_CNF_STRU        stTAF_CALL_EVT_CLCCECONF_INFO;      /* 0x34 */
        TAF_CALL_EVT_SEND_BURST_DTMF_CNF_STRU       stTAF_CALL_EVT_SEND_BURST_DTMF_CNF; /* 0x35 */
        TAF_CALL_EVT_SEND_BURST_DTMF_RSLT_STRU      stTAF_CALL_EVT_SEND_BURST_DTMF_RSLT;/* 0x36 */
        TAF_CALL_EVT_CCWAC_INFO_IND_STRU            stTAF_CALL_EVT_CCWAC_INFO_IND;      /* 0x37 */
        TAF_CALL_EVT_SEND_CONT_DTMF_CNF_STRU        stTAF_CALL_EVT_SEND_CONT_DTMF_CNF;  /* 0x38 */
        TAF_CALL_EVT_SEND_CONT_DTMF_RSLT_STRU       stTAF_CALL_EVT_SEND_CONT_DTMF_RSLT; /* 0x39 */
        TAF_CALL_EVT_RCV_CONT_DTMF_IND_STRU         stTAF_CALL_EVT_RCV_CONT_DTMF_IND;   /* 0x3a */
        TAF_CALL_EVT_RCV_BURST_DTMF_IND_STRU        stTAF_CALL_EVT_RCV_BURST_DTMF_IND;  /* 0x3b */
        TAF_CALL_EVT_CCLPR_GET_CNF_STRU             stTAF_CALL_EVT_CCLPR_GET_CNF;       /* 0x3c */
    }u;

}TAF_AT_ELF_MN_CALLBACK_CS_CALL_STRU;

/*****************************************************************************
 结构名    : ID_AT_IMSA_CIREG_SET_REQ_ELF_STRU
 结构说明  : ID_AT_IMSA_CIREG_SET_REQ消息对应的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    AT_IMSA_MSG_TYPE_ENUM_UINT32                    usMsgName;                              /* 消息名 */
    MN_CLIENT_ID_T                                  clientId;                               /* Client ID */
    MN_OPERATION_ID_T                               opId;                                   /* Operation ID */
    VOS_UINT8                                       aucReserve2[1];                         /* 保留 */
    AT_IMSA_IMS_REG_STATE_REPORT_ENUM_UINT32        enCireg;                          /* 消息内容 */
}ID_AT_IMSA_CIREG_SET_REQ_ELF_STRU;

/*****************************************************************************
 结构名    : ID_AT_IMSA_CIREG_QRY_REQ_ELF_STRU
 结构说明  : ID_AT_IMSA_CIREG_QRY_REQ消息对应的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    AT_IMSA_MSG_TYPE_ENUM_UINT32                    usMsgName;                              /* 消息名 */
    MN_CLIENT_ID_T                                  clientId;                               /* Client ID */
    MN_OPERATION_ID_T                               opId;                                   /* Operation ID */
    VOS_UINT8                                       aucReserve2[1];                         /* 保留 */
}ID_AT_IMSA_CIREG_QRY_REQ_ELF_STRU;

/*****************************************************************************
 结构名    : ID_AT_IMSA_CIREP_SET_REQ_ELF_STRU
 结构说明  : ID_AT_IMSA_CIREP_SET_REQ消息对应的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    AT_IMSA_MSG_TYPE_ENUM_UINT32                    usMsgName;                              /* 消息名 */
    MN_CLIENT_ID_T                                  clientId;                               /* Client ID */
    MN_OPERATION_ID_T                               opId;                                   /* Operation ID */
    VOS_UINT8                                       aucReserve2[1];                         /* 保留 */
    AT_IMSA_CIREP_REPORT_ENUM_UINT32                enReport;                          /* 消息内容 */
}ID_AT_IMSA_CIREP_SET_REQ_ELF_STRU;

/*****************************************************************************
 结构名    : ID_AT_IMSA_CIREP_QRY_REQ_ELF_STRU
 结构说明  : ID_AT_IMSA_CIREP_QRY_REQ消息对应的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    AT_IMSA_MSG_TYPE_ENUM_UINT32                    usMsgName;                              /* 消息名 */
    MN_CLIENT_ID_T                                  clientId;                               /* Client ID */
    MN_OPERATION_ID_T                               opId;                                   /* Operation ID */
    VOS_UINT8                                       aucReserve2[1];                         /* 保留 */
}ID_AT_IMSA_CIREP_QRY_REQ_ELF_STRU;



/*****************************************************************************
 结构名    : TAF_XSMS_ELF_APP_AT_CNF_STRU
 结构说明  : XSMS给AT上报的消息结构对应的映射结构体
 1.日    期   : 2015年12月04日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    TAF_XSMS_APP_MSG_TYPE_ENUM_UINT32               enUnionStructSelChoice;
    MN_CLIENT_ID_T                                  usClientId;
    MN_OPERATION_ID_T                               ucOpId;
    VOS_UINT8                                       ucRsv;
    VOS_UINT32                                      ulError;
    union
    {
        TAF_XSMS_INIT_IND_STRU                      stInitInd;                  /* 00 */
        TAF_ELF_NULL_STRU                           stNull1;                    /* 占位 */
        TAF_ELF_NULL_STRU                           stSndCnf;                   /* 02 */
        TAF_ELF_NULL_STRU                           stNull2;                    /* 占位 */
        TAF_XSMS_WRITE_CNF_STRU                     stWriteCnf;                 /* 04 */
        TAF_ELF_NULL_STRU                           stNull3;                    /* 占位 */
        TAF_ELF_NULL_STRU                           stDelCnf;                   /* 06 */
        TAF_XSMS_SEND_SUCC_IND_STRU                 stSndSuccInd;               /* 07 */
        TAF_XSMS_SEND_FAIL_IND_STRU                 stSndFailInd;               /* 08 */
        TAF_XSMS_RCV_IND_STRU                       stRcvInd;                   /* 09 */
        TAF_ELF_NULL_STRU                           stUimFullInd;               /* 10 */
    }u;
}TAF_XSMS_ELF_APP_AT_CNF_STRU;



/*****************************************************************************
 结构名    :  MN_CALL_ELF_APP_REQ_MSG_STRU
 结构说明  :  从AT发往TAF的APP呼叫请求消息对应的结构体
 1.日    期   : 2015年12月05日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    MN_CALL_APP_REQ_ENUM_UINT32                     enUnionStructSelChoice;
    MN_CLIENT_ID_T                                  clientId;
    MN_OPERATION_ID_T                               opId;
    MN_CALL_ID_T                                    callId;
    union
    {
        TAF_ELF_NULL_STRU                           stNull1;                    /* 占位 */
        MN_CALL_ORIG_PARAM_STRU                     stOrig;                     /* 0x1 */
        MN_CALL_END_PARAM_STRU                      stEnd;                      /* 0x2 */
        MN_CALL_ANS_PARAM_STRU                      stAns;                      /* 0x3 */
        TAF_CALL_DTMF_PARAM_STRU                    stStartDtmf;                /* 0x4 */
        TAF_CALL_DTMF_PARAM_STRU                    stStopDtmf;                 /* 0x5 */
        MN_CALL_SUPS_PARAM_STRU                     stCallMgmtCmd;              /* 0x6 */
        TAF_ELF_NULL_STRU                           stGetInfoReq;               /* 0x7 */
        TAF_ELF_NULL_STRU                           stGetCdurReq;               /* 0x8 */
        MN_CALL_UUS1_PARAM_STRU                     stSetUus1Info;              /* 0x9 */
        TAF_ELF_NULL_STRU                           stGEtUus1Info;              /* 0xa */
        MN_CALL_SET_ALS_PARAM_STRU                  stSetAls;                   /* 0xb */
        TAF_ELF_NULL_STRU                           stQryAls;                   /* 0xc */
        TAF_ELF_NULL_STRU                           stMaxReq;                   /* 0xd */
        MN_CALL_APP_CUSTOM_ECC_NUM_REQ_STRU         stEccNumReq;                /* 0xe */
        TAF_ELF_NULL_STRU                           stTafAgentMnGetCallInfo;    /* 0xf */
        TAF_ELF_NULL_STRU                           stClprGetReq;               /* 0x10 */
        TAF_ELF_NULL_STRU                           stXlemaReq;                 /* 0x11 */
        MN_CALL_SET_CSSN_REQ_STRU                   stCssnReq;                  /* 0x12 */
        TAF_ELF_NULL_STRU                           stEcallInfoReq;             /* 0x13 */
        TAF_ELF_NULL_STRU                           stFlashReq;                 /* 占位 */
        TAF_ELF_NULL_STRU                           stBurstDtmfReq;             /* 占位 */
        TAF_ELF_NULL_STRU                           stCustomDialReq;            /* 占位 */
        MN_CALL_MODIFY_REQ_STRU                     stModifyReq;                /* 0x17 */
        MN_CALL_MODIFY_REQ_STRU                     stRemoteModifyReq;          /* 0x18 */
        TAF_CALL_ECONF_DIAL_REQ_STRU                stEconfDial;                /* 0x19 */
        TAF_ELF_NULL_STRU                           stEconfCallInfo;            /* 0x1a */
    }u;
} MN_CALL_ELF_APP_REQ_MSG_STRU;

/*****************************************************************************
 结构名    :  MN_ELF_MSG_SEND_PARM_STRU
 结构说明  :  MN_MSG_SEND_PARM_STRU结构体的映射结构体
 1.日    期   : 2015年12月07日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_ELF_APP_REQ_MSG_STRU
    MN_MSG_SEND_PARM_STRU                           stSndParm;
}MN_ELF_MSG_SEND_PARM_STRU;

/*****************************************************************************
 结构名    :  MN_ELF_MSG_SEND_FROMMEM_PARM_STRU
 结构说明  :  MN_MSG_SEND_FROMMEM_PARM_STRU结构体的映射结构体
 1.日    期   : 2015年12月07日
   作    者   : h00360002
   修改内容   : 新建
*****************************************************************************/
typedef struct
{
    MN_ELF_APP_REQ_MSG_STRU
