/******************************************************************************

                  °æÈ¨ËùÓÐ (C), 2001-2011, »ªÎª¼¼ÊõÓÐÏÞ¹«Ë¾

 ******************************************************************************
  ÎÄ ¼þ Ãû   : embms_om_def.h
  °æ ±¾ ºÅ   : ³õ¸å
  ×÷    Õß   : s00137707
  Éú³ÉÈÕÆÚ   : 2012Äê3ÔÂ24ÈÕ
  ×î½üÐÞ¸Ä   :
  ¹¦ÄÜÃèÊö   : ¶¨ÒåembmsÄ£¿éOMÐèÒªÉÏ±¨µÄ½á¹¹Ìå
  º¯ÊýÁÐ±í   :
  ÐÞ¸ÄÀúÊ·   :
  1.ÈÕ    ÆÚ   : 2011Äê3ÔÂ24ÈÕ
    ×÷    Õß   : s00137707
    ÐÞ¸ÄÄÚÈÝ   : ´´½¨ÎÄ¼þ

******************************************************************************/

/************************************************************
                     °üº¬ÆäËüÄ£¿éµÄÍÎÄ¼þ
************************************************************/

/************************************************************
                               ºê¶¨Òå
************************************************************/

/************************************************************
                             Êý¾Ý½á¹¹¶¨Òå
************************************************************/

/************************************************************
                             ½Ó¿Úº¯ÊýÉùÃ÷
 ************************************************************/

#ifndef __EMBMS_OM_DEF_H__
#define __EMBMS_OM_DEF_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */



/************************************************************
                    1. REQÃüÁîºÍ¶ÔÓ¦µÄÊý¾Ý½á¹¹¶¨Òå
************************************************************/
typedef enum
{
    LPHY_REQ_EMBMS_TM_REQUEST           = OM_CMD_ID(LPHY_EMBMS_MID, OM_TYPE_REQ, 0x1),
    LPHY_REQ_EMBMS_CP_REQUEST,
}LPHY_EMBMS_REQ_ENUM;

typedef UINT16 LPHY_EMBMS_REQ_ENUM_UINT16;


typedef struct
{
    OM_REQ_ENABLE_ENUM enOmTmSwitch;
    OM_REQ_ENABLE_ENUM enOmCpSwitch;
}LPHY_OM_REQ_EMBMS_STRU;

/************************************************************
                    2. CNFÊý¾Ý½á¹¹¶¨Òå
************************************************************/


/************************************************************
                    3. IndÊý¾Ý½á¹¹¶¨Òå
************************************************************/


/************************************************************
                    4. TRACEÊý¾Ý½á¹¹¶¨Òå
************************************************************/
typedef enum
{
    LPHY_TRACE_EMBMS_MCCH_SETUP           = OM_CMD_ID(LPHY_CHANCTRL_MID, OM_TYPE_TRACE, 0x1),
    LPHY_TRACE_EMBMS_PMCH_SETUP,
    LPHY_TRACE_EMBMS_MRNTI_CONFIG,
    LPHY_TRACE_EMBMS_MBSFN_CONFIG,
    LPHY_TRACE_EMBMS_STOP,
    LPHY_TRACE_EMBMS_MAC_STOP
}LPHY_EMBMS_TRACE_ENUM;

typedef UINT16 LPHY_EMBMS_TRACE_ENUM_UINT16;

typedef struct
{
    UINT16      usSysFrmNum;    /*ÏµÍ³Ö¡ºÅ*/
    UINT16      usSubFrmNum;    /*×ÓÖ¡ºÅ*/
    UINT16      usSymbNum;      /*µ±Ç°·ûºÅÊý*/
    UINT16      usReserved;
    UINT32      ulData1;
    UINT32      ulData2;
    UINT32      ulData3;
    UINT32      ulData4;
}LPHY_OM_TRACE_EMBMS_STRU;




#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __CHANCTRL_OM_DEF_H__ */


